["school", "of", "computing", "sciences", "uea", "vacancies", "contact", "us", "sign", "in", "uea", "students", "and", "staff", "everyone", "else", "main", "menu", "home", "study", "with", "us", "go", "to", "study", "with", "us", "home", "undergraduate", "course", "finder", "clearing", "and", "adjustment", "request", "a", "prospectus", "mini", "open", "day", "applying", "accommodation", "scholarships", "fees", "and", "funding", "visit", "us", "student", "life", "advice", "for", "future", "students", "mature", "students", "your", "future", "career", "ask", "uea", "new", "students", "postgraduate", "course", "finder", "accommodation", "applying", "request", "a", "prospectus", "postgraduate", "taught", "degrees", "fees", "scholarships", "and", "loans", "visit", "us", "postgraduate", "research", "degrees", "phds", "studentships", "research", "themes", "fees", "and", "funding", "how", "to", "apply", "international", "your", "country", "eu", "students", "studying", "in", "the", "uk", "applying", "as", "an", "international", "student", "fees", "and", "funding", "visit", "us", "accommodation", "international", "families", "international", "summer", "school", "a", "study", "international", "malaysia", "international", "office", "malaysia", "international", "office", "a", "study", "international", "foundation", "and", "diploma", "programmes", "foundation", "and", "diploma", "programmes", "international", "programmes", "contact", "us", "short", "courses", "and", "professional", "development", "foundation", "courses", "cpd", "summer", "schools", "free", "online", "learning", "information", "for", "parents", "teachers", "young", "people", "parents", "teachers", "young", "people", "study", "abroad", "and", "exchange", "incoming", "outgoing", "contact", "us", "research", "research", "research", "themes", "explore", "uea", "research", "postgraduate", "research", "about", "uea", "research", "research", "performance", "fellowships", "faculties", "and", "schools", "go", "to", "faculties", "and", "schools", "home", "arts", "and", "humanities", "art", "media", "and", "american", "studies", "history", "interdisciplinary", "institute", "for", "the", "humanities", "literature", "drama", "and", "creative", "writing", "politics", "philosophy", "language", "and", "communication", "studies", "graduate", "school", "medicine", "and", "health", "sciences", "health", "sciences", "norwich", "medical", "school", "centre", "for", "interprofessional", "practice", "continuing", "professional", "development", "graduate", "school", "science", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "computing", "sciences", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "physics", "graduate", "school", "social", "sciences", "economics", "education", "and", "lifelong", "learning", "geography", "international", "development", "law", "norwich", "business", "school", "psychology", "social", "work", "graduate", "school", "business", "go", "to", "business", "home", "contact", "us", "funding", "opportunities", "sponsored", "research", "knowledge", "transfer", "partnerships", "consultancy", "gis", "consulting", "consultancy", "case", "studies", "facilities", "testing", "conference", "space", "our", "laboratories", "testing", "our", "specialist", "facilities", "licensing", "opportunities", "digital", "creative", "and", "heritage", "medical", "and", "life", "sciences", "engineering", "healthcare", "and", "social", "science", "marine", "agriculture", "and", "environmental", "business", "financial", "and", "legal", "access", "uea", "talent", "mycareercentral", "raise", "your", "profile", "promote", "your", "opportunities", "share", "your", "knowledge", "cpd", "training", "professional", "development", "language", "development", "mba", "programmes", "business", "partnerships", "uea", "companies", "norwich", "research", "park", "norfolk", "network", "associated", "partners", "alumni", "and", "supporters", "go", "to", "alumni", "and", "supporters", "home", "your", "uea", "update", "your", "details", "latest", "news", "where", "are", "they", "now", "benefits", "and", "services", "keep", "learning", "bookshelf", "newsletters", "annual", "magazine", "mailing", "preferences", "archive", "ziggurat", "website", "stay", "involved", "host", "an", "event", "alumni", "groups", "worldwide", "submit", "career", "case", "study", "the", "difference", "campaign", "campaign", "news", "impact", "stories", "make", "a", "gift", "donor", "lists", "alumni", "call", "campaign", "leaving", "a", "legacy", "events", "careers", "contact", "us", "donate", "current", "students", "and", "staff", "about", "us", "go", "to", "about", "us", "home", "visiting", "and", "staying", "getting", "to", "uea", "tourist", "information", "visitor", "accommodation", "campus", "map", "campus", "facilities", "our", "university", "chancellor", "vice", "chancellor", "executive", "team", "university", "structure", "student", "charter", "history", "of", "the", "university", "annual", "reports", "and", "publications", "corporate", "social", "responsibility", "charities", "information", "equality", "and", "diversity", "sustainability", "widening", "participation", "community", "engagement", "freedom", "of", "information", "creating", "headroom", "media", "room", "latest", "news", "media", "experts", "meet", "the", "communications", "team", "information", "for", "student", "journalists", "interview", "guidance", "press", "release", "archive", "fast", "facts", "internal", "communications", "key", "dates", "and", "events", "semester", "dates", "events", "music", "centre", "contact", "us", "vacancies", "contact", "us", "computing", "school", "of", "computing", "sciences", "school", "of", "computing", "sciences", "school", "of", "computing", "sciences", "faculties", "and", "schools", "science", "school", "of", "computing", "sciences", "undergraduate", "degrees", "postgraduate", "taught", "degrees", "research", "degrees", "people", "research", "careers", "and", "employability", "engagement", "and", "outreach", "equality", "and", "athena", "swan", "new", "student", "information", "working", "with", "business", "continuing", "professional", "development", "news", "and", "events", "contact", "us", "current", "students", "alumni", "about", "the", "faculty", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "research", "physics", "fellowships", "graduate", "school", "one", "of", "the", "most", "experienced", "schools", "of", "computing", "sciences", "in", "the", "uk", "one", "of", "the", "most", "experienced", "schools", "of", "computing", "sciences", "in", "the", "uk", "latest", "news", "cmp", "and", "earlham", "researchers", "develop", "new", "phylogenetics", "software", "package", "latest", "events", "computer", "graphics", "vr", "and", "ar", "in", "medical", "applications", "publications", "recently", "published", "publications", "welcome", "to", "the", "school", "of", "computing", "sciences", "were", "founded", "over", "years", "ago", "and", "we", "pride", "ourselves", "on", "teaching", "and", "research", "that", "is", "relevant", "to", "the", "needs", "of", "now", "and", "the", "future", "believe", "that", "we", "learn", "by", "doing", "so", "we", "teach", "using", "a", "practical", "hands", "on", "approach", "in", "combination", "with", "the", "latest", "theories", "our", "graduates", "are", "highly", "employable", "once", "they", "finish", "their", "degrees", "the", "latest", "employment", "figures", "show", "that", "of", "our", "undergraduates", "found", "work", "or", "study", "within", "six", "months", "of", "leaving", "and", "of", "those", "were", "in", "graduate", "level", "jobs", "our", "research", "has", "won", "awards", "and", "prizes", "and", "is", "dominated", "by", "what", "the", "research", "excellence", "framework", "ref", "called", "world", "leading", "internationally", "excellent", "output", "our", "laboratory", "facilities", "are", "outstanding", "offering", "general", "computing", "labs", "a", "specialised", "computer", "graphics", "lab", "an", "electronics", "hardware", "lab", "we", "are", "committed", "to", "the", "principles", "of", "the", "athena", "swan", "charter", "recognises", "and", "celebrates", "good", "practice", "in", "recruiting", "retaining", "and", "promoting", "women", "in", "science", "technology", "engineering", "mathematics", "and", "medicine", "stemm", "in", "higher", "education", "we", "have", "already", "been", "awarded", "a", "bronze", "award", "and", "are", "in", "the", "process", "of", "applying", "for", "a", "silver", "award", "also", "on", "undergraduate", "degrees", "working", "with", "business", "postgraduate", "degrees", "research", "news", "and", "events", "research", "degrees", "popular", "with", "other", "visitors", "undergraduate", "study", "postgraduate", "study", "find", "a", "course", "student", "life", "in", "norwich", "uea", "research", "about", "uea", "study", "with", "us", "uea", "faculty", "pages", "arts", "and", "humanities", "medicine", "and", "health", "sciences", "science", "social", "sciences", "undergraduate", "prospectus", "download", "download", "prospectus", "back", "to", "top", "download", "prospectus", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "uea", "all", "rights", "reserved", "university", "of", "east", "anglia", "norwich", "research", "park", "norwich", "norfolk", "nr", "tj", "uk", "switchboard", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection"]