["school", "of", "computing", "sciences", "uea", "vacancies", "contact", "us", "sign", "in", "uea", "students", "and", "staff", "everyone", "else", "main", "menu", "home", "study", "with", "us", "go", "to", "study", "with", "us", "home", "undergraduate", "course", "finder", "clearing", "and", "adjustment", "request", "prospectus", "mini", "open", "day", "applying", "accommodation", "scholarships", "fees", "and", "funding", "visit", "us", "student", "life", "advice", "for", "future", "students", "mature", "students", "your", "future", "career", "ask", "uea", "new", "students", "postgraduate", "course", "finder", "accommodation", "applying", "request", "prospectus", "postgraduate", "taught", "degrees", "fees", "scholarships", "and", "loans", "visit", "us", "postgraduate", "research", "degrees", "phds", "studentships", "research", "themes", "fees", "and", "funding", "how", "to", "apply", "meet", "our", "students", "international", "your", "country", "eu", "students", "studying", "in", "the", "uk", "applying", "as", "an", "international", "student", "fees", "and", "funding", "visit", "us", "accommodation", "international", "families", "international", "summer", "school", "malaysia", "international", "office", "foundation", "and", "diploma", "programmes", "international", "programmes", "contact", "us", "short", "courses", "and", "professional", "development", "foundation", "courses", "cpd", "summer", "schools", "free", "online", "learning", "information", "for", "parents", "teachers", "young", "people", "parents", "teachers", "young", "people", "study", "abroad", "and", "exchange", "incoming", "outgoing", "contact", "us", "research", "research", "research", "themes", "explore", "uea", "research", "postgraduate", "research", "about", "uea", "research", "research", "performance", "fellowships", "faculties", "and", "schools", "go", "to", "faculties", "and", "schools", "home", "arts", "and", "humanities", "art", "media", "and", "american", "studies", "history", "interdisciplinary", "institute", "for", "the", "humanities", "literature", "drama", "and", "creative", "writing", "politics", "philosophy", "language", "and", "communication", "studies", "graduate", "school", "medicine", "and", "health", "sciences", "health", "sciences", "norwich", "medical", "school", "centre", "for", "interprofessional", "practice", "continuing", "professional", "development", "graduate", "school", "science", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "computing", "sciences", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "physics", "graduate", "school", "social", "sciences", "economics", "education", "and", "lifelong", "learning", "geography", "international", "development", "law", "norwich", "business", "school", "psychology", "social", "work", "graduate", "school", "business", "go", "to", "business", "home", "contact", "us", "funding", "opportunities", "sponsored", "research", "knowledge", "transfer", "partnerships", "consultancy", "gis", "consulting", "consultancy", "case", "studies", "facilities", "testing", "conference", "space", "our", "laboratories", "testing", "our", "specialist", "facilities", "licensing", "opportunities", "digital", "creative", "and", "heritage", "medical", "and", "life", "sciences", "engineering", "healthcare", "and", "social", "science", "marine", "agriculture", "and", "environmental", "business", "financial", "and", "legal", "access", "uea", "talent", "mycareercentral", "raise", "your", "profile", "promote", "your", "opportunities", "share", "your", "knowledge", "cpd", "training", "professional", "development", "language", "development", "mba", "programmes", "business", "partnerships", "uea", "companies", "norwich", "research", "park", "norfolk", "network", "associated", "partners", "alumni", "and", "supporters", "go", "to", "alumni", "and", "supporters", "home", "your", "uea", "update", "your", "details", "latest", "news", "where", "are", "they", "now", "benefits", "and", "services", "keep", "learning", "bookshelf", "newsletters", "annual", "magazine", "mailing", "preferences", "archive", "ziggurat", "website", "stay", "involved", "host", "an", "event", "alumni", "groups", "worldwide", "submit", "career", "case", "study", "the", "difference", "campaign", "campaign", "news", "impact", "stories", "make", "gift", "donor", "lists", "alumni", "call", "campaign", "leaving", "legacy", "events", "careers", "contact", "us", "donate", "current", "students", "and", "staff", "about", "us", "go", "to", "about", "us", "home", "visiting", "and", "staying", "getting", "to", "uea", "tourist", "information", "visitor", "accommodation", "campus", "map", "campus", "facilities", "our", "university", "chancellor", "vice", "chancellor", "executive", "team", "university", "structure", "student", "charter", "history", "of", "the", "university", "annual", "reports", "and", "publications", "corporate", "social", "responsibility", "charities", "information", "equality", "and", "diversity", "sustainability", "widening", "participation", "community", "engagement", "freedom", "of", "information", "creating", "headroom", "media", "room", "latest", "news", "media", "experts", "meet", "the", "communications", "team", "information", "for", "student", "journalists", "interview", "guidance", "press", "release", "archive", "fast", "facts", "internal", "communications", "key", "dates", "and", "events", "semester", "dates", "events", "music", "centre", "contact", "us", "vacancies", "contact", "us", "computing", "school", "of", "computing", "sciences", "school", "of", "computing", "sciences", "school", "of", "computing", "sciences", "faculties", "and", "schools", "science", "school", "of", "computing", "sciences", "undergraduate", "degrees", "postgraduate", "taught", "degrees", "research", "degrees", "people", "research", "careers", "and", "employability", "engagement", "and", "outreach", "equality", "and", "athena", "swan", "new", "student", "information", "working", "with", "business", "continuing", "professional", "development", "news", "and", "events", "contact", "us", "current", "students", "alumni", "about", "the", "faculty", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "research", "physics", "fellowships", "graduate", "school", "one", "of", "the", "most", "experienced", "schools", "of", "computing", "sciences", "in", "the", "uk", "one", "of", "the", "most", "experienced", "schools", "of", "computing", "sciences", "in", "the", "uk", "latest", "news", "cmp", "and", "earlham", "researchers", "develop", "new", "phylogenetics", "software", "package", "latest", "events", "cmp", "pgr", "day", "publications", "recently", "published", "publications", "welcome", "to", "the", "school", "of", "computing", "sciences", "were", "founded", "over", "years", "ago", "and", "we", "pride", "ourselves", "on", "teaching", "and", "research", "that", "is", "relevant", "to", "the", "needs", "of", "now", "and", "the", "future", "believe", "that", "we", "learn", "by", "doing", "so", "we", "teach", "using", "practical", "hands", "on", "approach", "in", "combination", "with", "the", "latest", "theories", "our", "graduates", "are", "highly", "employable", "once", "they", "finish", "their", "degrees", "the", "latest", "employment", "figures", "show", "that", "of", "our", "undergraduates", "found", "work", "or", "study", "within", "six", "months", "of", "leaving", "and", "of", "those", "were", "in", "graduate", "level", "jobs", "our", "research", "has", "won", "awards", "and", "prizes", "and", "is", "dominated", "by", "what", "the", "research", "excellence", "framework", "ref", "called", "world", "leading", "internationally", "excellent", "output", "our", "laboratory", "facilities", "are", "outstanding", "offering", "general", "computing", "labs", "specialised", "computer", "graphics", "lab", "an", "electronics", "hardware", "lab", "we", "are", "committed", "to", "the", "principles", "of", "the", "athena", "swan", "charter", "recognises", "and", "celebrates", "good", "practice", "in", "recruiting", "retaining", "and", "promoting", "women", "in", "science", "technology", "engineering", "mathematics", "and", "medicine", "stemm", "in", "higher", "education", "we", "have", "already", "been", "awarded", "bronze", "award", "and", "are", "in", "the", "process", "of", "applying", "for", "silver", "award", "also", "on", "undergraduate", "degrees", "working", "with", "business", "postgraduate", "degrees", "research", "news", "and", "events", "research", "degrees", "popular", "with", "other", "visitors", "undergraduate", "study", "postgraduate", "study", "find", "course", "student", "life", "in", "norwich", "uea", "research", "about", "uea", "study", "with", "us", "uea", "faculty", "pages", "arts", "and", "humanities", "medicine", "and", "health", "sciences", "science", "social", "sciences", "undergraduate", "prospectus", "download", "download", "prospectus", "back", "to", "top", "download", "prospectus", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "uea", "all", "rights", "reserved", "university", "of", "east", "anglia", "norwich", "research", "park", "norwich", "norfolk", "nr", "tj", "uk", "switchboard", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "lewin", "lewin", "lewin", "lewin", "pc", "lewin", "advanced", "purpose", "support", "lewin", "lewin", "lewin", "after", "professor", "douglas", "lewin", "who", "was", "former", "head", "boasts", "pcs", "windows", "bit", "standard", "alongside", "some", "more", "use", "solely", "this", "range", "equipment", "use", "which", "include", "lego", "nxt", "robots", "pc", "workstations", "altera", "programmable", "logic", "boards", "arm", "cortex", "boards", "shown", "image", "workstations", "oscilloscope", "signal", "generator", "psu", "multi", "meter", "etc", "spectrum", "analyser", "lewin", "ranges", "from", "design", "implementation", "through", "use", "lego", "nxt", "robots", "why", "choose", "at", "why", "choose", "at", "can", "offer", "you", "ranked", "nd", "satisfaction", "nss", "offer", "degree", "aligned", "aspirations", "inter", "disciplinary", "will", "enable", "you", "understand", "contemporary", "applications", "track", "onto", "topics", "comprises", "expert", "academic", "scientists", "plus", "links", "industry", "you", "guaranteed", "best", "cutting", "edge", "full", "time", "full", "time", "page", "items", "per", "page", "showing", "results", "first", "previous", "next", "last", "title", "bsc", "bsc", "year", "industry", "bsc", "applied", "year", "bsc", "systems", "bsc", "systems", "year", "industry", "bsc", "imaging", "multimedia", "bsc", "imaging", "multimedia", "year", "industry", "beng", "systems", "beng", "systems", "year", "industry", "bsc", "mcomp", "bsc", "mcomp", "year", "bsc", "year", "industry", "page", "items", "per", "page", "showing", "results", "first", "previous", "next", "last", "book", "touch", "touch", "tel", "fax", "email", "cmpmth", "lso", "ac", "admissions", "enquiries", "please", "email", "admissions", "ac", "statistics", "mining", "ict", "statistics", "mining", "ict", "providing", "expertise", "offers", "may", "be", "publicly", "available", "delivered", "sites", "tailored", "delivered", "either", "organisation", "premises", "further", "discussion", "tailored", "professionaldevelopment", "programming", "introductory", "java", "programming", "statistics", "mining", "dependence", "modelling", "multivariate", "copulas", "discovery", "datamining", "overview", "discovery", "datamining", "includes", "interacting", "objects", "virtual", "environments", "three", "dimensions", "stereoscopic", "displays", "projection", "used", "projects", "it", "useful", "see", "examples", "visualising", "complex", "structures", "such", "proteins", "plants", "haptic", "feedback", "devices", "users", "interact", "input", "device", "capable", "exerting", "forces", "during", "interaction", "often", "it", "useful", "create", "physical", "object", "out", "virtual", "models", "view", "zcorp", "printer", "capable", "printing", "out", "colour", "models", "used", "variety", "projects", "related", "architecture", "biology", "cultural", "if", "interested", "printer", "refer", "sys", "web", "fig", "stereoscopic", "fig", "printer", "following", "hubs", "forms", "service", "living", "off", "discussions", "board", "documents", "ethics", "specific", "guidelines", "handbook", "kb", "exam", "papers", "theses", "phd", "phd", "probationary", "period", "experience", "post", "docs", "right", "prepare", "right", "prepare", "cent", "secure", "positions", "continue", "academia", "gone", "become", "sales", "executives", "earning", "competitive", "salaries", "whilst", "others", "secured", "positions", "established", "ibm", "aviva", "logica", "program", "analysts", "designers", "managers", "others", "followed", "entrepreneurial", "path", "established", "own", "while", "chose", "continue", "enter", "academia", "professionally", "market", "very", "competitive", "endeavour", "ensure", "receive", "prepare", "them", "transition", "reflect", "skills", "relate", "these", "potential", "give", "run", "invaluable", "workshops", "finding", "techniques", "write", "cv", "effectively", "job", "follow", "below", "according", "interest", "internships", "job", "enter", "login", "external", "postdoc", "positions", "others", "queries", "director", "prof", "gerard", "parr", "invest", "heavily", "majority", "based", "currently", "dedicated", "masters", "running", "enterprise", "operating", "system", "number", "installed", "primarily", "each", "equipped", "mixture", "hp", "viglen", "desktops", "machines", "running", "packages", "based", "coursework", "installed", "msc", "dedicated", "masters", "contains", "viglen", "desktops", "machines", "running", "packages", "based", "coursework", "installed", "up", "date", "desktop", "oscilloscopes", "generators", "analysers", "newest", "apple", "macintosh", "fitted", "imacs", "ipads", "ipod", "term", "sessions", "when", "not", "project", "provision", "laptop", "computers", "opening", "times", "usually", "am", "pm", "opening", "times", "usually", "am", "pm", "note", "times", "subject", "change", "addition", "hour", "library", "haptics", "sustainable", "collaborative", "relationships", "local", "national", "businesses", "part", "commitment", "close", "commercial", "activities", "including", "company", "sysco", "collaboration", "commercial", "mean", "step", "changing", "recent", "activities", "runs", "programme", "businesses", "bespoke", "individual", "syrinix", "haptimol", "urban", "group", "lingua", "past", "animgen", "monitoring", "agac", "accessed", "via", "swipe", "card", "rd", "elite", "desk", "intel", "core", "processor", "gb", "ram", "gb", "ssd", "nvidia", "geforce", "gtx", "cards", "desk", "inch", "elitedisplay", "led", "monitor", "autodesk", "ds", "max", "autocad", "photoshop", "adobe", "suite", "read", "proud", "announce", "its", "progressive", "inclusive", "culture", "subjects", "able", "examine", "way", "widely", "men", "family", "caring", "responsibilities", "dual", "achieve", "flourish", "address", "gender", "inequalities", "requires", "action", "levels", "tackle", "unequal", "representation", "requires", "cultures", "attitudes", "across", "absence", "management", "making", "levels", "broad", "implications", "examine", "high", "loss", "rate", "urgent", "concern", "address", "contracts", "particularly", "negative", "consequences", "retention", "progression", "there", "both", "personal", "structural", "obstacles", "making", "into", "require", "active", "consideration", "organization", "regular", "meetings", "self", "assessment", "take", "place", "involving", "representatives", "levels", "roles", "look", "many", "aspects", "place", "identify", "areas", "improvement", "feeds", "into", "plays", "strong", "role", "influencing", "changes", "central", "policies", "strategy", "central", "steering", "committee", "active", "agenda", "keen", "play", "helping", "positive", "equal", "holder", "towards", "particularly", "female", "candidates", "societies", "networks", "nominations", "developher", "bcs", "societies", "networks", "sprint", "developments", "bcs", "grants", "developher", "alg", "summary", "cignets", "workshop", "london", "hopper", "colloquium", "epsrc", "inclusion", "prominent", "bbc", "documentary", "ada", "lovelace", "posters", "zip", "margaret", "hamilton", "suffrage", "scheme", "maths", "mb", "dr", "gavin", "cawley", "lecturer", "miss", "lisanne", "gitsels", "padma", "mr", "matthew", "gooch", "officer", "dr", "katharina", "huber", "lecturer", "elena", "kulinskaya", "katie", "co", "ordinator", "nadia", "mobbs", "manager", "dr", "taoyang", "lecturer", "agri", "tech", "processing", "vision", "forum", "organized", "chartered", "insurance", "lms", "chartered", "insurance", "allianz", "joint", "th", "unconscious", "bias", "jan", "colloquim", "lms", "th", "dec", "associate", "tutors", "honorary", "holders", "admin", "bielefeld", "bielefeld", "germany", "finishing", "her", "she", "spent", "two", "marsden", "postdoctoral", "fellow", "massey", "palmerston", "north", "zealand", "problems", "beginning", "she", "moved", "sundsvall", "sweden", "she", "joined", "department", "discrete", "two", "she", "moved", "uppsala", "sweden", "she", "joined", "department", "biometry", "swedish", "agricultural", "linnaeus", "bioinformatics", "april", "she", "docent", "uppsala", "she", "moved", "united", "kingdom", "she", "joined", "aug", "she", "promoted", "senior", "since", "feb", "she", "member", "mathematical", "society", "always", "welcomes", "she", "would", "someone", "assist", "her", "novel", "mathematical", "methodology", "algorithms", "help", "processes", "drive", "evolution", "however", "she", "seriously", "consider", "applicants", "would", "like", "any", "area", "her", "unfortunately", "she", "unlikely", "studentship", "but", "would", "help", "additional", "contacts", "list", "computational", "gambette", "scholz", "uprooted", "phylogenetic", "bulletin", "mathematical", "pp", "text", "repository", "article", "francis", "moulton", "wu", "bounds", "phylogenetic", "metrics", "journal", "mathematical", "text", "repository", "article", "pub", "ahead", "print", "moulton", "steel", "minimum", "triplet", "covers", "binary", "phylogenetic", "trees", "journal", "mathematical", "pp", "text", "repository", "article", "pub", "ahead", "print", "gambette", "kelk", "challenge", "reconstructing", "phylogenetic", "triplets", "clusters", "journal", "mathematical", "pp", "text", "repository", "article", "van", "iersel", "moulton", "scornavacca", "wu", "reconstructing", "phylogenetic", "nondense", "binet", "trinet", "sets", "algorithmica", "pp", "text", "repository", "article", "moulton", "steel", "wu", "folding", "unfolding", "phylogenetic", "trees", "journal", "mathematical", "pp", "text", "repository", "article", "scholz", "beyond", "representing", "orthology", "relations", "trees", "algorithmica", "text", "repository", "article", "pub", "ahead", "print", "moulton", "wu", "transforming", "phylogenetic", "moving", "beyond", "tree", "journal", "theoretical", "pp", "text", "repository", "article", "dress", "koolen", "moulton", "spillner", "characterizing", "block", "graphs", "terms", "vertex", "induced", "partitions", "australasian", "journal", "combinatorics", "pp", "repository", "article", "linz", "moulton", "wu", "spaces", "phylogenetic", "generalized", "nearest", "neighbor", "interchange", "operations", "journal", "mathematical", "pp", "text", "repository", "article", "kettleborough", "distinguished", "minimal", "topological", "lassos", "siam", "journal", "discrete", "pp", "text", "repository", "article", "van", "iersel", "moulton", "wu", "much", "needed", "infer", "reticulate", "evolutionary", "histories", "systematic", "pp", "text", "repository", "article", "kettleborough", "dicks", "roberts", "reconstructing", "super", "trees", "sets", "missing", "distances", "lost", "molecular", "evolution", "pp", "text", "repository", "article", "popescu", "psiko", "versatile", "tool", "infer", "population", "stratification", "various", "gwas", "bioinformatics", "pp", "text", "repository", "article", "popescu", "harper", "trick", "bancroft", "novel", "population", "inference", "kernel", "pca", "optimization", "psiko", "genetics", "pp", "text", "repository", "article", "moulton", "semple", "wu", "representing", "partitions", "trees", "siam", "journal", "discrete", "pp", "text", "repository", "article", "steel", "reconstructing", "fully", "resolved", "trees", "triplet", "cover", "distances", "electronic", "journal", "combinatorics", "article", "no", "repository", "article", "dress", "steel", "matroid", "phylogenetic", "tree", "discrete", "theoretical", "pp", "repository", "article", "moulton", "encoding", "constructing", "nested", "phylogenetic", "trinets", "algorithmica", "pp", "text", "repository", "article", "popescu", "lassoing", "corralling", "rooted", "phylogenetic", "trees", "bulletin", "mathematical", "pp", "text", "repository", "article", "interests", "senior", "computational", "member", "computational", "her", "interests", "developing", "mathematical", "theory", "algorithms", "help", "shed", "light", "processes", "drive", "molecular", "evolution", "combinatorial", "cluster", "finite", "metric", "spaces", "selected", "her", "list", "always", "welcomes", "she", "would", "someone", "assist", "her", "novel", "mathematical", "methodology", "algorithms", "help", "processes", "drive", "evolution", "however", "she", "seriously", "consider", "applicants", "would", "like", "any", "area", "her", "unfortunately", "she", "unlikely", "studentship", "but", "would", "help", "selected", "moulton", "encoding", "constructing", "nested", "phylogenetic", "trinets", "algorithmica", "gambette", "encodings", "phylogenetic", "bounded", "journal", "mathematical", "dress", "steel", "phylogenetic", "tree", "basic", "properties", "shellings", "covers", "journal", "mathematical", "dress", "koolen", "moulton", "spillner", "basic", "phylogenetic", "combinatorics", "cambrige", "indicators", "esteem", "member", "editorial", "journal", "mathematical", "member", "algorithms", "bioinformatics", "member", "computational", "molecular", "fellow", "evolutionary", "synthesis", "center", "nescent", "durham", "north", "carolina", "usa", "aug", "invited", "participant", "iplant", "grand", "challenges", "entitled", "assembling", "tree", "plant", "iptol", "arizona", "usa", "nov", "invited", "fellow", "isaac", "newton", "mathematical", "cambridge", "sept", "her", "invitations", "speak", "conferences", "phylogenetic", "lorentz", "center", "netherlands", "oct", "motifs", "phylogenies", "schloss", "dagstuhl", "germany", "july", "directions", "tropical", "manchester", "tropical", "geometry", "computational", "saarbruecken", "germany", "she", "champion", "organizing", "seminar", "series", "computational", "incorrect", "generated", "november", "click", "get", "fresh", "copy", "collaborations", "members", "datasets", "human", "retrieval", "build", "build", "wide", "exciting", "enabling", "specialise", "allied", "build", "different", "disciplines", "encourage", "choosing", "my", "mscs", "paths", "improve", "prospects", "taken", "style", "margin", "cm", "margin", "cm", "margin", "bottom", "pt", "margin", "left", "cm", "line", "height", "pt", "re", "wants", "pursue", "discover", "pays", "style", "margin", "cm", "margin", "cm", "margin", "bottom", "pt", "margin", "left", "cm", "line", "height", "pt", "re", "generally", "pioneering", "british", "scholarship", "options", "options", "style", "margin", "cm", "margin", "cm", "margin", "bottom", "pt", "margin", "left", "cm", "line", "height", "pt", "lunchtime", "simply", "tour", "looking", "listed", "above", "alternatively", "try", "search", "under", "construction", "fdm", "evenings", "fdm", "join", "production", "june", "holding", "evening", "june", "opportunity", "production", "invite", "pdf", "ukoug", "never", "better", "join", "sector", "ukoug", "holding", "nextgen", "attendance", "designed", "opportunity", "focus", "oracle", "cvs", "employers", "prospect", "employers", "opportunity", "thinking", "friends", "midlands", "might", "willing", "travel", "birmingham", "city", "unable", "still", "ukoug", "final", "paid", "internship", "permanent", "universities", "partnership", "epos", "master", "class", "morning", "friday", "involve", "introduction", "epos", "technologies", "practices", "client", "base", "then", "opportunity", "replicate", "practices", "designed", "fun", "carried", "informal", "relaxed", "atmosphere", "end", "mornings", "lunch", "provided", "delighted", "dimension", "epos", "confirmed", "recruit", "mornings", "therefore", "unique", "opportunity", "internship", "permanent", "position", "doorstep", "hoping", "fill", "multiple", "tester", "application", "developer", "designer", "developer", "database", "developer", "ms", "sql", "epos", "vibrant", "ambitious", "point", "sale", "provide", "branded", "innovative", "designed", "house", "expanding", "rapidly", "turnover", "increasing", "join", "archant", "growth", "timing", "morning", "confirmed", "shortly", "attending", "avoid", "disappointment", "link", "epos", "www", "eposnow", "com", "questions", "karl", "anton", "adviser", "sci", "anton", "eposnow", "com", "flyer", "pdf", "drop", "adviser", "karl", "anton", "microsoft", "imagine", "administer", "maintenance", "repairs", "servers", "aware", "only", "purchased", "do", "regarding", "personally", "owned", "instead", "check", "hand", "side", "recommended", "repair", "dreamspark", "location", "floor", "itcs", "uea_computing", "twitter", "uea_computing", "twitter", "tweets", "uea_computing", "know", "lots", "before", "arrive", "worry", "here", "guide", "necessary", "administrative", "tasks", "giving", "insight", "section", "directly", "clicking", "arrival", "question", "directly", "postgraduates", "seminars", "archives", "together", "developed", "spectre", "source", "simplifies", "publish", "success", "pi", "julia", "koricheva", "rhul", "gillian", "petrokofsky", "oxford", "successful", "nerc", "evidence", "pilot", "success", "publish", "council", "nnuh", "council", "mrc", "between", "john", "phillips", "ear", "nose", "throat", "consultant", "council", "nnuh", "publish", "nikoloulopoulos", "speaker", "second", "second", "meetup", "thursday", "historic", "marble", "hall", "surrey", "street", "nikoloulopoulos", "speaker", "second", "publish", "med", "makes", "breakthrough", "prostate", "cancer", "test", "distinguishes", "prostate", "cancer", "developed", "vincent", "bogdan", "luca", "collaborated", "colin", "cooper", "med", "daniel", "med", "makes", "breakthrough", "prostate", "cancer", "publish", "seminars", "seminars", "arcy", "thomson", "presentation", "vr", "ar", "publish", "generate", "signals", "syndromic", "surveillance", "age", "generate", "signals", "syndromic", "surveillance", "semi", "supervised", "classification", "generate", "signals", "syndromic", "surveillance", "publish", "vr", "ar", "jsc", "speaker", "nigel", "john", "institution", "chester", "organiser", "michal", "mackiewicz", "vr", "ar", "publish", "symbolic", "ultrametrics", "maps", "speaker", "guillaume", "institution", "organiser", "michal", "mackiewicz", "symbolic", "ultrametrics", "maps", "publish", "classification", "speaker", "tony", "bagnall", "institution", "classification", "publish", "organised", "speech", "machine", "speech", "optimisation", "machine", "innes", "sainsbury", "genome", "analysis", "food", "hospital", "trust", "performed", "prospective", "supervisors", "whose", "viewed", "prospective", "admiss", "anticipated", "start", "october", "start", "entry", "points", "january", "funded", "competitively", "funded", "funded", "applicant", "competitively", "funded", "set", "provides", "tax", "stipend", "approximately", "special", "motion", "capture", "sensitive", "dark", "sound", "recording", "considerable", "instance", "collaborate", "building", "visualise", "molecules", "recognition", "lip", "reading", "similar", "tools", "exploring", "exploring", "increasingly", "need", "efficiently", "browse", "large", "databases", "images", "example", "images", "certain", "type", "scene", "perhaps", "picture", "beach", "sunset", "typically", "searches", "keywords", "example", "user", "beach", "sunset", "words", "beach", "sunset", "engine", "browse", "resulting", "matches", "images", "argued", "alternative", "mode", "searching", "outline", "sketch", "being", "searched", "engine", "images", "conforming", "sketch", "user", "example", "kind", "images", "cases", "possible", "perform", "content", "extract", "content", "images", "content", "indeed", "quite", "sophisticated", "engines", "content", "particular", "looked", "images", "sensible", "example", "again", "beach", "sunset", "images", "likely", "contain", "large", "regions", "yellow", "sand", "red", "orange", "sun", "perhaps", "blue", "sky", "sea", "images", "containing", "colours", "expect", "amongst", "large", "beach", "scenes", "exploring", "retrievalindexing", "brief", "outline", "indexing", "aid", "helpful", "understanding", "represented", "figure", "takes", "form", "pixel", "pixel", "numbers", "represented", "tell", "respectively", "red", "green", "blue", "pixel", "dimensional", "phenomenon", "conveniently", "represented", "ordinate", "axes", "correspond", "pixel", "represented", "dimensional", "figure", "shows", "colours", "figure", "represented", "dimensional", "importantly", "cannot", "contain", "arbitrary", "responses", "rather", "values", "pixel", "restricted", "example", "typical", "coded", "bits", "response", "integer", "value", "implies", "possible", "colours", "observable", "restricted", "cube", "referred", "cube", "figure", "distribution", "colours", "scene", "purposes", "trying", "compare", "images", "comparing", "pixel", "pixel", "basis", "computationally", "expensive", "procedure", "furthermore", "immediate", "arise", "compare", "images", "size", "happens", "images", "contain", "same", "single", "differently", "located", "figure", "example", "histogram", "figure", "blueness", "corresponds", "pixels", "corresponding", "swain", "ballard", "investigate", "aid", "indexing", "suggested", "could", "overcome", "alternative", "proposed", "histogram", "histogram", "formed", "divided", "cells", "bins", "pixel", "determined", "bins", "falls", "count", "pixels", "assigned", "bin", "kept", "pixels", "processed", "counts", "divided", "total", "pixels", "thus", "bin", "measure", "proportion", "pixels", "fall", "bin", "figure", "illustration", "histogram", "figure", "region", "bin", "figure", "coloured", "less", "brightly", "proportion", "pixels", "fall", "swain", "ballard", "showed", "possible", "discriminate", "reasonably", "large", "images", "ongoing", "investigation", "problem", "continued", "investigation", "important", "ways", "well", "known", "recorded", "depend", "just", "surfaces", "being", "imaged", "amongst", "things", "imaged", "fact", "account", "easy", "demonstrate", "indexing", "fail", "contributions", "made", "overcoming", "problem", "issue", "indexing", "originally", "proposed", "relates", "fact", "represented", "fact", "alternative", "ways", "represent", "pixel", "investigating", "representations", "appropriate", "task", "third", "issue", "original", "indexing", "pertains", "histogram", "represent", "than", "itself", "comparing", "histograms", "computationally", "demanding", "problem", "overcome", "investigating", "efficient", "representations", "contributions", "made", "latter", "issues", "outlined", "compressing", "chromaticity", "histograms", "figure", "shows", "corresponding", "chromaticity", "histogram", "represented", "chromaticity", "histogram", "itself", "grey", "scale", "pixel", "corresponds", "bin", "quantised", "chromaticity", "brighter", "pixel", "greater", "corresponding", "histogram", "value", "chromaticity", "histogram", "leads", "naturally", "idea", "conventional", "compression", "compression", "histogram", "figure", "corresponding", "chromaticity", "histogram", "displayed", "compression", "technique", "jpeg", "observation", "lot", "redundant", "discarded", "little", "quality", "example", "redundancy", "fact", "images", "contain", "large", "regions", "identical", "pixel", "values", "another", "saying", "pixel", "values", "slowly", "spatial", "extent", "quickly", "pixels", "formally", "quantified", "spatial", "frequency", "transforms", "example", "fourier", "transform", "dft", "cosine", "transform", "dct", "figure", "shows", "grey", "scale", "version", "figure", "corresponding", "cosine", "transform", "jpeg", "pixel", "corresponds", "particular", "spatial", "frequency", "value", "function", "tells", "something", "captured", "pixel", "figure", "clear", "contained", "few", "spatial", "frequency", "elements", "elements", "correspond", "low", "frequencies", "jpeg", "works", "throwing", "away", "held", "spatial", "frequencies", "thus", "reducing", "storage", "requirements", "figure", "corresponding", "chromaticity", "histogram", "displayed", "coding", "histograms", "investigated", "whether", "frequency", "coding", "histogram", "efficient", "coding", "discovered", "answer", "yes", "salient", "held", "histogram", "adequately", "represented", "just", "few", "spatial", "frequency", "components", "method", "works", "dct", "histogram", "element", "cosine", "transform", "corresponds", "cosine", "certain", "frequency", "example", "figure", "shows", "spatial", "frequency", "functions", "value", "transform", "tells", "corresponding", "frequency", "contributes", "histogram", "reconstruct", "histogram", "frequency", "weighted", "sum", "frequency", "components", "weights", "determined", "frequency", "reduced", "amount", "represent", "histogram", "spatial", "frequency", "elements", "bins", "histogram", "elements", "frequency", "small", "contribute", "little", "weighted", "sum", "histogram", "reconstructed", "thus", "taking", "weighted", "sum", "just", "few", "frequency", "components", "obtain", "approximation", "original", "histogram", "represent", "histogram", "just", "few", "numbers", "weights", "frequencies", "required", "approximation", "original", "histogram", "figure", "basis", "functions", "cosine", "transform", "histogram", "compression", "achieved", "typically", "chromaticity", "histograms", "accurately", "represented", "just", "frequency", "components", "represents", "factor", "reduction", "frequency", "transforms", "dct", "dft", "hadamard", "successfully", "compress", "hybrid", "coding", "histograms", "frequency", "transforms", "dct", "dft", "hadamard", "differ", "underlying", "spatial", "frequency", "functions", "dct", "functions", "cosine", "functions", "frequencies", "figure", "whereas", "dft", "functions", "combinations", "sine", "cosine", "functions", "functions", "form", "basis", "histogram", "thought", "particular", "functions", "effect", "accuracy", "raises", "whether", "particular", "optimal", "well", "known", "choice", "basis", "function", "important", "particular", "transform", "karhunen", "loeve", "transform", "optimal", "sense", "parsimonious", "description", "drawback", "transform", "fact", "particular", "basis", "functions", "employs", "fixed", "dct", "dft", "must", "discovered", "particular", "being", "modelled", "essentially", "basis", "functions", "derived", "principal", "components", "histograms", "basis", "functions", "accurate", "important", "derived", "adequately", "samples", "underlying", "sampled", "particular", "domain", "histograms", "difficult", "basis", "functions", "derived", "adequately", "represent", "encountered", "karhunen", "loeve", "transform", "inappropriate", "histograms", "major", "reason", "fact", "histograms", "tend", "quite", "sparse", "bins", "histogram", "unoccupied", "thus", "discovering", "robust", "basis", "functions", "than", "feasibly", "employed", "principal", "component", "compress", "histograms", "initial", "compression", "example", "dct", "coding", "histograms", "histogram", "represented", "small", "say", "dct", "coefficients", "histogram", "represented", "dimensional", "given", "corresponding", "histograms", "determine", "basis", "functions", "dct", "coefficient", "vectors", "corresponding", "histograms", "adequately", "represented", "small", "say", "principal", "components", "stage", "compression", "achieved", "stage", "fact", "being", "analysed", "dct", "coefficients", "longer", "sparse", "fact", "means", "discovered", "components", "robust", "underlying", "method", "reduce", "required", "accurately", "represent", "factor", "approximate", "stage", "hybrid", "coding", "reduced", "dct", "components", "derived", "turn", "original", "histogram", "another", "strand", "investigating", "accurately", "retrieving", "images", "great", "representations", "example", "particular", "task", "mind", "example", "loosely", "codes", "underlying", "represents", "long", "wave", "red", "medium", "wave", "green", "wave", "blue", "encode", "images", "captured", "camera", "correspond", "camera", "actual", "measures", "images", "intended", "display", "crt", "driven", "values", "control", "energy", "emitted", "phosphors", "again", "typically", "produce", "long", "medium", "wave", "regions", "clear", "necessarily", "efficient", "investigated", "alternative", "representations", "particular", "focused", "opponent", "simple", "linear", "transform", "opponent", "codes", "intensity", "value", "wb", "chromatic", "values", "redness", "greenness", "rg", "blueness", "yellowness", "thought", "visual", "encodes", "well", "justified", "theoretic", "maximises", "modify", "opponent", "rather", "coding", "dealing", "situation", "compare", "images", "captured", "illuminants", "illumination", "must", "histograms", "leads", "inevitably", "failure", "varying", "illumination", "conditions", "solve", "problem", "must", "model", "discount", "effect", "illuminant", "well", "known", "certain", "circumstances", "single", "surface", "captured", "lights", "diagonal", "matrix", "transform", "illuminant", "original", "independent", "scale", "factors", "observe", "happens", "model", "log", "opponent", "tells", "illumination", "log", "opponent", "ordinates", "translational", "follows", "remove", "effect", "illumination", "need", "subtract", "chromaticity", "pixel", "subtracted", "chromaticities", "form", "histograms", "compress", "described", "advantage", "invariant", "illumination", "experiments", "leads", "greatly", "improved", "rates", "illumination", "ongoing", "indexing", "particular", "investigating", "incorporate", "spatial", "features", "index", "bibliography", "bach", "fuller", "gupta", "hampapur", "horowitz", "humphrey", "jain", "virage", "engine", "spie", "conf", "storage", "video", "databases", "volume", "berens", "finlayson", "log", "opponent", "chromaticity", "coding", "proceedings", "pattern", "september", "buchsbaum", "gottschalk", "chromaticity", "ordinates", "frequency", "limited", "functions", "optical", "america", "finlayson", "coefficient", "constancy", "thesis", "simon", "fraser", "funt", "martin", "constancy", "enough", "european", "springer", "hurvich", "jameson", "opponent", "color", "review", "finlayson", "qiu", "indexing", "compressed", "histograms", "rerieval", "jolliffe", "principal", "component", "springer", "verlag", "york", "niblack", "barber", "qbic", "querying", "images", "content", "color", "texture", "shape", "storage", "video", "databases", "volume", "spie", "proceedings", "stricker", "orengo", "similarity", "color", "images", "spie", "conf", "storage", "video", "databases", "iii", "volume", "swain", "ballard", "indexing", "ladd", "administrator", "phone", "mrs", "heidi", "prada", "analyst", "phone", "binoop", "pulikkottil", "technical", "phone", "russell", "smith", "administrator", "phone", "peter", "trollope", "technician", "phone", "interactive", "xbox", "robotics", "automated", "mindstorms", "raising", "pre", "raising", "pre", "several", "activity", "days", "aims", "expand", "existing", "offered", "robotics", "animation", "visits", "newspaper", "report", "days", "schedule", "schedules", "flexible", "accommodate", "several", "days", "activity", "session", "session", "robot", "session", "game", "conclusion", "timetable", "structured", "upon", "session", "robotics", "robotics", "robotics", "session", "schedule", "offered", "throughout", "aim", "supplement", "without", "interrupting", "restrictions", "contacting", "arranged", "around", "suits", "concerned", "pam", "mayhew", "ideas", "outside", "educational", "experiences", "spark", "imagination", "clearer", "wish", "valuable", "environment", "advise", "activity", "ideas", "planning", "evaluation", "assistance", "expenses", "fund", "loan", "audio", "recorders", "cas", "cas", "hub", "meets", "twice", "pulls", "around", "merrier", "come", "along", "groupspaces", "ncas", "meeting", "stop", "graduation", "want", "pass", "showcase", "lead", "guises", "chance", "let", "happening", "association", "ex", "association", "context", "reproduction", "scanning", "unified", "common", "theme", "pedigree", "publishing", "journals", "proven", "record", "builds", "ethic", "maintains", "ties", "modellers", "photo", "realistic", "modellers", "photo", "realistic", "modellers", "photo", "realistic", "landscapes", "buildings", "populated", "humans", "characters", "football", "stadium", "petrol", "station", "illustrating", "redevelopment", "enhancing", "tourism", "attractions", "manually", "produced", "detailed", "automatically", "buildings", "animated", "flythroughs", "stills", "traditional", "cd", "rom", "dvd", "skilled", "animators", "modellers", "rendered", "animations", "dynamic", "visualised", "navigated", "contributing", "contributing", "almost", "every", "facet", "lives", "diverse", "disney", "institutes", "acclaimed", "rated", "exercise", "judged", "mostly", "built", "solid", "sources", "councils", "nhs", "government", "sources", "ltd", "enables", "presented", "clients", "authorities", "smes", "spun", "informs", "influences", "vital", "field", "brewer", "distinction", "aggressive", "harmful", "sometimes", "damaging", "unnecessary", "treatment", "cancers", "progress", "diagnosis", "threatening", "die", "disease", "unlike", "cancers", "cancers", "cause", "symptoms", "threatening", "diagnosis", "reliably", "distinguish", "clinically", "cancers", "graduating", "edward", "johnson", "he", "gained", "his", "carve", "ecommerce", "seen", "benefit", "edward", "johnson", "significantly", "helped", "chosen", "conversation", "studied", "accountancy", "translated", "vacation", "katrina", "lowles", "worked", "hvb", "designing", "plan", "infrastructure", "inspired", "katrina", "started", "hvb", "graduating", "unicredit", "katrina", "lowles", "colleagues", "playing", "solving", "figuring", "slickest", "extensible", "solution", "requirement", "grasped", "infinite", "complexity", "versatility", "teaches", "gives", "confidence", "pantelis", "unforgettable", "me", "especially", "comes", "games", "opened", "me", "module", "studied", "moreover", "thanks", "lecturers", "took", "games", "competition", "star", "came", "certainly", "me", "pursuing", "result", "journey", "magnificent", "studios", "finally", "myself", "programmer", "neon", "mobile", "studios", "four", "mohammed", "obaid", "siddiqui", "memories", "thanks", "professors", "helped", "me", "biocon", "india", "brought", "added", "mention", "exposure", "me", "dissertation", "prepared", "me", "order", "recommend", "name", "deputy", "andy", "andy", "rudy", "lapeer", "rudy", "lapeer", "innovation", "steven", "hayward", "steven", "hayward", "dan", "dan", "richard", "harvey", "richard", "harvey", "pa", "sue", "spurgeon", "sue", "spurgeon", "nurunnahar", "akter", "aliya", "aleryani", "alia", "algurashi", "abeer", "alharbi", "zahyah", "alharbi", "tahani", "alkhudaydi", "abdulaziz", "almajed", "saleh", "alyahyan", "salma", "alzahrani", "bird", "aaron", "bostrom", "tutor", "ellen", "bowler", "renato", "busatto", "figueiredo", "frank", "carver", "chutoo", "tutor", "collaborates", "collaborators", "received", "sponsors", "funders", "collaborators", "derby", "bradford", "mit", "autonoma", "barcelona", "inria", "rhone", "alpes", "industrial", "collaborators", "agfa", "hewlett", "packard", "sony", "agfa", "hewlett", "packard", "sony", "nuffield", "housed", "thompson", "dart", "physically", "dart", "promotes", "integrative", "spanning", "hierarchy", "ecosystem", "carrying", "dart", "develops", "nrp", "nrp", "largest", "site", "concentration", "diet", "dart", "closely", "biologists", "nrp", "institutions", "latex", "mac", "os", "netbeans", "spss", "paradigm", "reviewed", "annually", "updated", "packaged", "soon", "netbeans", "spss", "studio", "paradigm", "logical", "teamwork", "logical", "teamwork", "duration", "hours", "venue", "stephen", "laycock", "automate", "manufacturing", "situations", "endanger", "even", "fire", "burning", "bomb", "disposal", "un", "manned", "drone", "aircraft", "military", "automating", "stimulus", "fulfilling", "starts", "prototype", "demonstrated", "constructed", "programmed", "nxc", "languages", "although", "simpler", "nature", "focuses", "logical", "respond", "sensors", "defined", "actions", "occurs", "certificate", "created", "meta", "lang", "en", "abstract", "played", "supporting", "products", "hospitals", "rehearsal", "surgical", "rehabilitation", "talk", "illustrated", "changed", "silicon", "workstation", "real", "present", "affordable", "htc", "vive", "hololens", "possibilities", "highlight", "exist", "gain", "commercialisation", "background", "until", "chair", "bangor", "prior", "charge", "visualization", "silicon", "inc", "zeneca", "pharmaceuticals", "wales", "rivic", "nischr", "visualization", "unit", "satava", "acknowledge", "accomplishments", "visualization", "learned", "wales", "flsw", "http", "nigeljohn", "org", "biography", "obtained", "mechanical", "college", "ghent", "belgium", "engineer", "volvo", "cars", "europe", "ghent", "engineer", "informatics", "ghent", "rug", "meanwhile", "embarked", "completed", "euro", "punch", "prediction", "adverse", "pregnancy", "outcomes", "clinical", "completed", "subsequently", "fellowship", "bio", "college", "ucl", "augmented", "reality", "navigation", "casspar", "ucl", "mtt", "appointed", "feel", "discuss", "gerikhanov", "audinis", "simulation", "vacuum", "extraction", "childbirth", "paper", "jeffrey", "dao", "garc\u00eda", "chen", "shickell", "rowland", "philpott", "passive", "coordinate", "measurement", "tracking", "rigid", "endoscope", "augmented", "reality", "guided", "surgery", "assisted", "surgery", "audinis", "gerikhanov", "dupuis", "simulation", "obstetric", "forceps", "placement", "assisted", "intervention", "miccai", "boston", "ma", "ii", "isbn", "contribution", "gasson", "karri", "hyperelastic", "skin", "simulation", "ieee", "transactions", "biomedical", "shah", "rowland", "optimised", "radial", "algorithm", "non", "rigid", "registration", "gasson", "karri", "simulating", "plastic", "surgery", "skin", "tensile", "tests", "hyperelastic", "biophysics", "shah", "rowland", "non", "rigid", "registration", "guided", "surgery", "paper", "gasson", "fitting", "hyperelastic", "material", "stress", "strain", "vitro", "experiment", "skin", "paper", "gonzalez", "garcia", "consistency", "intra", "operative", "registration", "enhanced", "navigation", "iesn", "miua", "gonzalez", "garcia", "consistency", "intra", "operative", "registration", "augmented", "reality", "navigation", "paper", "gonzalez", "garcia", "augmented", "reality", "navigation", "minimally", "invasive", "surgery", "paper", "shah", "rowland", "non", "rigid", "registration", "paper", "chen", "gonzalez", "linney", "alusi", "enhanced", "navigation", "endoscopic", "sinus", "surgery", "evaluating", "calibration", "registration", "tracking", "assisted", "surgery", "chen", "enhanced", "navigation", "iesn", "paper", "rowland", "non", "rigid", "registration", "thin", "plate", "biharmonic", "splines", "paper", "chen", "gonzalez", "garcia", "intra", "operative", "registration", "enhanced", "endoscopic", "sinus", "surgery", "consistency", "mmvr", "informatics", "gasson", "vitro", "skin", "tissue", "experiment", "increased", "realism", "surgery", "simulations", "mmvr", "informatics", "heatley", "rowland", "bell", "rowland", "hegarty", "dodd", "calvert", "scott", "rae", "dicom", "viewer", "theatre", "procedures", "mdt", "networked", "paper", "marsland", "trotting", "horse", "mechanical", "simulation", "obstetric", "forceps", "augmented", "reality", "magical", "becomes", "iop", "isbn", "chapter", "visualisation", "navigation", "simulation", "simulation", "biomechanics", "broader", "encompasses", "mechanics", "augmented", "reality", "fea", "numerical", "methods", "navigation", "platform", "arview", "enhanced", "augmented", "reality", "navigation", "aimed", "ent", "surgery", "microscope", "rigid", "sinus", "endoscope", "intra", "operative", "visualisation", "roger", "rowland", "rmr", "dview", "aimed", "rendering", "modalities", "ray", "ct", "mri", "pet", "frequently", "simulation", "solutions", "acceleration", "explicit", "fe", "simulate", "surgery", "procedures", "vitro", "skin", "assess", "hyper", "visco", "elastic", "childbirth", "biomechanics", "fetal", "moulding", "forceps", "delivery", "fetal", "biomechanics", "shoulder", "dystocia", "vehicle", "dynamics", "vpex", "trotting", "horse", "chen", "gonzalez", "linney", "alusi", "enhanced", "navigation", "endoscopic", "sinus", "surgery", "evaluating", "calibration", "registration", "tracking", "assisted", "surgery", "doi", "rcs", "shah", "rowland", "optimised", "radial", "algorithm", "non", "rigid", "registration", "prager", "fetal", "moulding", "fetal", "skull", "subjected", "uterine", "pressures", "labour", "biomechanics", "prager", "recovery", "newborn", "skull", "thin", "plate", "splines", "computerized", "st", "ug", "ug", "college", "ltn", "reviewer", "renowned", "coordinator", 