["school", "computing", "sciences", "uea", "cdata", "var", "liferay", "browser", "acceptsgzip", "function", "return", "false", "getmajorversion", "function", "return", "getrevision", "function", "return", "getversion", "function", "return", "isair", "function", "return", "false", "ischrome", "function", "return", "false", "isfirefox", "function", "return", "false", "isgecko", "function", "return", "false", "isie", "function", "return", "false", "isiphone", "function", "return", "false", "islinux", "function", "return", "false", "ismac", "function", "return", "false", "ismobile", "function", "return", "false", "ismozilla", "function", "return", "false", "isopera", "function", "return", "false", "isrtf", "function", "return", "false", "issafari", "function", "return", "false", "issun", "function", "return", "false", "iswap", "function", "return", "false", "iswapxhtml", "function", "return", "false", "iswebkit", "function", "return", "false", "iswindows", "function", "return", "false", "iswml", "function", "return", "false", "data", "nav_selector", "iscustomizationview", "function", "return", "false", "notices", "null", "themedisplay", "getlayoutid", "function", "return", "getlayouturl", "function", "return", "https", "www", "uea", "ac", "uk", "computing", "home", "getparentlayoutid", "function", "return", "isprivatelayout", "function", "return", "false", "isvirtuallayout", "function", "return", "false", "getbcplanguageid", "function", "return", "en", "gb", "getcdnbaseurl", "function", "return", "https", "www", "uea", "ac", "uk", "getcdndynamicresourceshost", "function", "return", "getcdnhost", "function", "return", "getcompanyid", "function", "return", "getcompanygroupid", "function", "return", "getdefaultlanguageid", "function", "return", "en_gb", "getdoasuseridencoded", "function", "return", "getlanguageid", "function", "return", "en_gb", "getparentgroupid", "function", "return", "getpathcontext", "function", "return", "getpathimage", "function", "return", "image", "getpathjavascript", "function", "return", "html", "js", "getpathmain", "function", "return", "c", "getpaththemeimages", "function", "return", "https", "www", "uea", "ac", "uk", "uea", "theme", "images", "getpaththemeroot", "function", "return", "uea", "theme", "getplid", "function", "return", "getportalurl", "function", "return", "https", "www", "uea", "ac", "uk", "getportletsetupshowbordersdefault", "function", "return", "false", "getscopegroupid", "function", "return", "getscopegroupidorlivegroupid", "function", "return", "getsessionid", "function", "return", "getsitegroupid", "function", "return", "geturlcontrolpanel", "function", "return", "group", "control_panel", "refererplid", "geturlhome", "function", "return", "https", "xa", "xf", "xfwww", "xeuea", "xeac", "xeuk", "xfweb", "xfguest", "getuserid", "function", "return", "getusername", "function", "return", "isaddsessionidtourl", "function", "return", "false", "isfreeformlayout", "function", "return", "false", "isimpersonated", "function", "return", "false", "issignedin", "function", "return", "false", "isstateexclusive", "function", "return", "false", "isstatemaximized", "function", "return", "false", "isstatepopup", "function", "return", "false", "propsvalues", "ntlm_auth_enabled", "false", "var", "themedisplay", "liferay", "themedisplay", "liferay", "aui", "getavailablelangpath", "function", "return", "jsp", "browserid", "other", "getcombine", "function", "return", "true", "getcombopath", "function", "return", "combo", "browserid", "other", "getfilter", "function", "return", "getjavascriptrootpath", "function", "return", "html", "getlangpath", "function", "return", "jsp", "browserid", "other", "getstaticresourceurlparams", "function", "return", "browserid", "other", "liferay", "authtoken", "liferay", "currenturl", "xfweb", "xfcomputing", "liferay", "currenturlencoded", "xfweb", "xfcomputing", "cdata", "liferay", "portlet", "list", "function", "i", "s", "o", "g", "r", "a", "m", "i", "r", "i", "r", "i", "r", "function", "var", "arrayvalue", "i", "r", "q", "i", "r", "q", "arrayvalue", "i", "r", "q", "push", "arguments", "i", "r", "l", "new", "date", "a", "s", "createelement", "o", "m", "s", "getelementsbytagname", "o", "a", "async", "a", "src", "g", "m", "parentnode", "insertbefore", "a", "m", "window", "document", "www", "google", "analytics", "com", "analytics", "ga", "ga", "p_p_id__instance_yvmlmlqcjyf_", "portlet", "border", "width", "border", "style", "p_p_id__instance_rfx_", "portlet", "borderless", "container", "border", "width", "border", "style", "iframe", "src", "www", "googletagmanager", "com", "ns", "html", "id", "gtm", "tnfp", "height", "width", "style", "display", "none", "visibility", "hidden", "function", "w", "d", "s", "l", "i", "w", "l", "w", "l", "w", "l", "push", "new", "date", "gettime", "event", "var", "f", "d", "getelementsbytagname", "s", "j", "d", "createelement", "s", "dl", "l", "www", "googletagmanager", "com", "gtm", "js", "id", "i", "dl", "f", "parentnode", "insertbefore", "j", "f", "window", "document", "window", "nreum", "nreum", "__nr_require", "function", "t", "e", "n", "function", "r", "n", "if", "e", "n", "var", "o", "e", "n", "exports", "t", "n", "call", "o", "exports", "function", "e", "var", "o", "t", "n", "e", "return", "r", "o", "e", "o", "o", "exports", "return", "e", "n", "exports", "if", "function", "type", "__nr_require", "return", "__nr_require", "for", "var", "o", "o", "date", "gettime", "function", "t", "e", "n", "function", "r", "t", "if", "window", "performance", "o", "t", "ee", "i", "t", "handle", "a", "t", "s", "t", "t", "loader", "features", "stn", "t", "var", "c", "nreum", "o", "ev", "o", "on", "fn", "start", "function", "t", "e", "var", "n", "t", "n", "instance", "c", "n", "t", "n", "instance", "c", "window", "performance", "r", "t", "for", "var", "e", "t", "e", "o", "t", "s", "inplace", "t", "u", "d", "i", "function", "i", "t", "e", "return", "t", "var", "a", "t", "ee", "get", "events", "s", "t", "a", "c", "t", "gos", "f", "xmlhttprequest", "u", "addeventlistener", "d", "removeeventlistener", "e", "exports", "a", "getprototypeof", "in", "object", "r", "document", "r", "window", "r", "f", "prototype", "f", "prototype", "hasownproperty", "u", "n", "t", "if", "function", "type", "n", "var", "r", "c", "n", "nr", "wrapped", "function", "return", "s", "n", "fn", "null", "n", "name", "anonymous", "this", "wrapped", "t", "r", "else", "function", "type", "n", "handleevent", "e", "this", "wrapped", "e", "r", "t", "ee", "get", "history", "o", "t", "r", "e", "exports", "r", "o", "inplace", "window", "history", "pushstate", "replacestate", "function", "t", "e", "n", "var", "r", "t", "ee", "get", "raf", "o", "t", "r", "e", "exports", "r", "o", "inplace", "window", "requestanimationframe", "mozrequestanimationframe", "webkitrequestanimationframe", "msrequestanimationframe", "raf", "r", "on", "raf", "start", "function", "t", "t", "o", "t", "fn", "function", "t", "e", "n", "function", "r", "t", "e", "n", "t", "a", "t", "fn", "null", "n", "function", "o", "t", "e", "n", "this", "method", "n", "this", "timerduration", "number", "type", "t", "t", "t", "a", "t", "fn", "this", "n", "var", "i", "t", "ee", "get", "timer", "a", "t", "i", "e", "exports", "i", "a", "inplace", "window", "settimeout", "setimmediate", "settimer", "a", "inplace", "window", "setinterval", "setinterval", "a", "inplace", "window", "cleartimeout", "clearimmediate", "cleartimeout", "i", "on", "setinterval", "start", "r", "i", "on", "settimer", "start", "o", "function", "t", "e", "n", "function", "r", "t", "e", "d", "inplace", "e", "onreadystatechange", "fn", "s", "function", "o", "var", "t", "this", "e", "u", "context", "t", "t", "readystate", "i", "t", "w", "push", "t", "h", "a", "for", "var", "t", "tr", "r", "t", "removeeventlistener", "d", "r", "this", "listener", "if", "e", "aborted", "if", "n", "duration", "new", "date", "gettime", "this", "starttime", "t", "readystate", "e", "status", "t", "status", "var", "i", "o", "t", "this", "lastsize", "if", "i", "a", "t", "getresponseheader", "x", "newrelic", "app", "data", "a", "pop", "else", "e", "status", "n", "cbtime", "this", "cbtime", "u", "emit", "xhr", "done", "t", "t", "c", "xhr", "e", "n", "this", "starttime", "function", "o", "t", "e", "var", "n", "t", "responsetype", "if", "json", "n", "e", "var", "r", "arraybuffer", "n", "blob", "n", "json", "n", "t", "response", "t", "responsetext", "return", "i", "r", "function", "i", "t", "if", "string", "type", "t", "t", "length", "if", "object", "type", "t", "if", "undefined", "type", "arraybuffer", "instance", "arraybuffer", "t", "bytelength", "if", "undefined", "type", "blob", "instance", "blob", "t", "size", "if", "undefined", "type", "formdata", "instance", "formdata", "try", "return", "json", "stringify", "t", "length", "catch", "e", "return", "function", "a", "t", "e", "var", "n", "f", "e", "r", "t", "params", "r", "host", "n", "hostname", "n", "port", "r", "pathname", "n", "pathname", "t", "sameorigin", "n", "sameorigin", "var", "s", "t", "loader", "if", "s", "xhrwrappable", "var", "c", "t", "handle", "f", "t", "u", "t", "ee", "d", "load", "error", "abort", "timeout", "l", "d", "length", "p", "t", "id", "h", "t", "m", "window", "xmlhttprequest", "s", "features", "xhr", "t", "u", "on", "new", "xhr", "function", "t", "var", "e", "this", "e", "totalcbs", "e", "called", "e", "cbtime", "e", "end", "r", "e", "ended", "e", "xhrguids", "e", "lastsize", "null", "h", "nreum", "nreum", "loader_config", "n", "this", "metrics", "r", "t", "o", "this", "if", "n", "a", "i", "r", "a", "date", "gettime", "this", "listener", "function", "t", "try", "abort", "t", "type", "e", "onload", "s", "l", "s", "s", "e", "addeventlistener", "d", "s", "this", "listener", "u", "on", "xhr", "cb", "time", "function", "t", "e", "n", "this", "cbtime", "t", "e", "this", "onloadcalled", "this", "called", "this", "called", "this", "totalcbs", "this", "onloadcalled", "n", "onload", "this", "end", "n", "u", "on", "xhr", "load", "added", "function", "t", "e", "var", "n", "p", "t", "e", "this", "xhrguids", "n", "p", "t", "e", "this", "xhrguids", "this", "xhrguids", "n", "this", "totalcbs", "u", "on", "addeventlistener", "end", "function", "t", "e", "e", "instance", "m", "instance", "m", "instance", "m", "date", "gettime", "u", "on", "fn", "end", "function", "t", "e", "this", "xhrcbstart", "date", "gettime", "this", "xhrcbstart", "this", "onload", "e", "e", "function", "t", "e", "n", "e", "exports", "function", "t", "var", "e", "document", "createelement", "a", "n", "window", "location", "r", "e", "href", "t", "r", "port", "e", "port", "var", "o", "e", "href", "split", "r", "port", "i", "e", "protocol", "e", "protocol", "e", "protocol", "n", "protocol", "a", "e", "hostname", "document", "domain", "r", "sameorigin", "i", "r", "t", "e", "return", "function", "o", "t", "new", "date", "gettime", "concat", "a", "arguments", "null", "e", "var", "o", "t", "handle", "i", "t", "a", "t", "undefined", "type", "window", "newrelic", "s", "setpageviewname", "addpageaction", "setcustomattribute", "finished", "addtotrace", "inlinehit", "c", "addpageaction", "f", "api", "i", "s", "function", "t", "e", "newrelic", "e", "r", "f", "e", "api", "i", "c", "function", "t", "e", "newrelic", "e", "r", "f", "e", "e", "exports", "newrelic", "newrelic", "noticeerror", "function", "t", "string", "type", "t", "error", "t", "o", "err", "t", "new", "date", "gettime", "function", "t", "e", "n", "var", "r", "o", "navigator", "useragent", "match", "firefox", "s", "d", "d", "o", "r", "t", "e", "var", "n", "r", "i", "for", "r", "in", "t", "o", "call", "t", "r", "n", "var", "o", "object", "prototype", "hasownproperty", "e", "exports", "r", "function", "t", "e", "n", "function", "r", "t", "e", "n", "e", "e", "undefined", "type", "n", "r", "o", "n", "e", "i", "array", "o", "o", "rc", "c", "a", "c", "apply", "i", "r", "var", "u", "f", "v", "n", "return", "u", "d", "t", "e", "m", "t", "l", "t", "concat", "e", "function", "l", "t", "return", "m", "t", "function", "p", "t", "return", "u", "t", "u", "t", "o", "n", "function", "h", "t", "e", "c", "t", "function", "t", "n", "e", "e", "feature", "v", "n", "e", "e", "in", "f", "f", "e", "var", "m", "v", "w", "on", "d", "emit", "n", "get", "p", "listeners", "l", "context", "e", "buffer", "h", "return", "w", "function", "i", "return", "new", "r", "var", "a", "nr", "context", "s", "t", "gos", "c", "t", "f", "u", "d", "e", "exports", "o", "d", "backlog", "f", "gos", "function", "t", "e", "n", "function", "r", "t", "e", "n", "if", "o", "call", "t", "e", "return", "t", "e", "var", "r", "n", "if", "object", "defineproperty", "object", "defineproperty", "t", "e", "value", "r", "writable", "enumerable", "r", "catch", "i", "return", "t", "e", "r", "r", "var", "o", "object", "prototype", "hasownproperty", "e", "exports", "r", "handle", "function", "t", "e", "n", "function", "r", "t", "e", "n", "r", "o", "buffer", "t", "r", "o", "emit", "t", "e", "n", "var", "o", "t", "ee", "get", "handle", "e", "exports", "r", "r", "ee", "o", "id", "function", "t", "e", "n", "function", "r", "t", "var", "e", "type", "t", "return", "t", "object", "e", "o", "var", "o", "i", "nr", "id", "a", "t", "gos", "e", "exports", "r", "loader", "function", "t", "e", "n", "function", "r", "if", "m", "var", "t", "h", "info", "nreum", "info", "e", "u", "getelementsbytagname", "script", "if", "t", "n", "https", "d", "split", "t", "sslforhttp", "h", "proto", "n", "https", "http", "s", "mark", "onload", "a", "null", "api", "var", "r", "u", "createelement", "script", "r", "src", "h", "proto", "t", "agent", "e", "parentnode", "insertbefore", "r", "e", "function", "o", "complete", "u", "readystate", "i", "s", "mark", "domcontent", "a", "null", "api", "function", "a", "return", "new", "date", "gettime", "var", "s", "t", "handle", "c", "t", "f", "window", "u", "f", "document", "nreum", "o", "st", "settimeout", "ct", "cleartimeout", "xhr", "f", "xmlhttprequest", "req", "f", "request", "ev", "f", "event", "pr", "f", "promise", "mo", "f", "mutationobserver", "t", "var", "d", "location", "l", "beacon", "bam", "nr", "data", "net", "errorbeacon", "bam", "nr", "data", "net", "agent", "js", "agent", "newrelic", "com", "nr", "min", "js", "p", "window", "xmlhttprequest", "m", "loader", "nreum", "info", "beacon", "bam", "nr", "data", "net", "errorbeacon", "bam", "nr", "data", "net", "licensekey", "eecfa", "applicationid", "sa", "header", "sign", "in", "btns", "sign", "in", "blue", "display", "none", "aui", "portlet", "journal", "content", "aui", "portlet", "asset", "publisher", "background", "color", "eee", "aui", "uea", "banner", "portlet", "pagetitlebanner", "z", "index", "input", "name", "term", "type", "text", "class", "search", "query", "search", "text", "placeholder", "site", "search", "id", "header", "search", "text", "accesskey", "title", "access", "key", "onfocus", "if", "this", "value", "this", "value", "onblur", "if", "this", "value", "this", "value", "value", "site", "search", "vacancies", "contact", "us", "sign", "in", "uea", "students", "and", "staff", "everyone", "else", "var", "searchurl", "https", "www", "uea", "ac", "uk", "search", "function", "headertabsearch", "el", "window", "location", "href", "searchurl", "q", "el", "closest", "search", "form", "children", "search", "val", "search", "text", "keypress", "function", "event", "if", "event", "keycode", "event", "preventdefault", "this", "closest", "search", "form", "children", "search", "click", "return", "false", "search", "submit", "on", "function", "e", "e", "preventdefault", "headertabsearch", "this", "jquery", "document", "ready", "function", "navbtn", "click", "function", "supermenu", "slidetoggle", "this", "toggleclass", "active", "jquery", "document", "ready", "function", "searchbtn", "click", "function", "headerblock", "slidetoggle", "this", "toggleclass", "active", "supermenu", "height", "px", "supermenu", "content", "padding", "top", "px", "important", "text", "align", "left", "supermenu", "content", "div", "padding", "left", "px", "important", "supermenu", "dropdown_columns", "width", "px", "supermenu", "dropdown_columns", "width", "px", "supermenu", "div", "in", "menu", "list", "padding", "left", "px", "supermenu", "h", "padding", "left", "px", "important", "supermenu", "div", "wrapper", "hover", "background", "color", "transparent", "important", "color", "white", "important", "supermenu", "div", "parent", "hover", "color", "white", "important", "text", "decoration", "underline", "important", "supermenu", "width", "px", "important", "text", "align", "center", "supermenu", "righty", "margin", "right", "px", "float", "right", "supermenu", "wrapper", "zoom", "supermenu", "content", "padding", "top", "px", "important", "supermenu", "div", "div", "list", "style", "type", "none", "supermenu", "content", "div", "border", "style", "none", "solid", "solid", "border", "width", "medium", "px", "px", "supermenu", "width", "px", "important", "supermenu", "righty", "margin", "right", "px", "supermenu", "mid", "menu", "left", "px", "supermenu", "div", "div", "list", "style", "type", "none", "supermenu", "width", "px", "important", "supermenu", "righty", "margin", "right", "px", "supermenu", "ie", "hover", "content", "display", "block", "z", "index", "supermenu", "wrapper", "line", "height", "px", "supermenu", "parent", "font", "size", "px", "line", "height", "px", "margin", "auto", "display", "inline", "important", "supermenu", "tighty", "display", "inline", "important", "supermenu", "content", "position", "absolute", "important", "z", "index", "supermenu", "mid", "menu", "left", "px", "supermenu", "border", "left", "supermenu", "righty", "right", "px", "main", "menu", "home", "study", "with", "us", "go", "to", "study", "with", "us", "home", "undergraduate", "course", "finder", "clearing", "and", "adjustment", "request", "a", "prospectus", "mini", "open", "day", "applying", "accommodation", "scholarships", "fees", "and", "funding", "visit", "us", "student", "life", "advice", "for", "future", "students", "mature", "students", "your", "future", "career", "ask", "uea", "new", "students", "postgraduate", "course", "finder", "accommodation", "applying", "request", "a", "prospectus", "postgraduate", "taught", "degrees", "fees", "scholarships", "and", "loans", "visit", "us", "postgraduate", "research", "degrees", "phds", "studentships", "research", "themes", "fees", "and", "funding", "how", "to", "apply", "international", "your", "country", "eu", "students", "studying", "in", "the", "uk", "applying", "as", "an", "international", "student", "fees", "and", "funding", "visit", "us", "accommodation", "international", "families", "international", "summer", "school", "a", "href", "study", "international", "malaysia", "international", "fice", "malaysia", "international", "office", "a", "href", "study", "international", "foundation", "and", "diploma", "programmes", "foundation", "and", "diploma", "programmes", "international", "programmes", "contact", "us", "short", "courses", "and", "pressional", "development", "foundation", "courses", "cpd", "summer", "schools", "free", "online", "learning", "information", "for", "parents", "teachers", "young", "people", "parents", "teachers", "young", "people", "study", "abroad", "and", "exchange", "incoming", "outgoing", "contact", "us", "research", "research", "research", "themes", "explore", "uea", "research", "postgraduate", "research", "about", "uea", "research", "research", "performance", "fellowships", "faculties", "and", "schools", "go", "to", "faculties", "and", "schools", "home", "arts", "and", "humanities", "art", "media", "and", "american", "studies", "history", "interdisciplinary", "institute", "for", "the", "humanities", "literature", "drama", "and", "creative", "writing", "politics", "philosophy", "language", "and", "communication", "studies", "graduate", "school", "medicine", "and", "health", "sciences", "health", "sciences", "norwich", "medical", "school", "centre", "for", "interpressional", "practice", "continuing", "pressional", "development", "graduate", "school", "science", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "computing", "sciences", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "physics", "graduate", "school", "social", "sciences", "economics", "education", "and", "lifelong", "learning", "geography", "international", "development", "law", "norwich", "business", "school", "psychology", "social", "work", "graduate", "school", "business", "go", "to", "business", "home", "contact", "us", "funding", "opportunities", "sponsored", "research", "knowledge", "transfer", "partnerships", "consultancy", "gis", "consulting", "consultancy", "case", "studies", "facilities", "testing", "conference", "space", "our", "laboratories", "testing", "our", "specialist", "facilities", "licensing", "opportunities", "digital", "creative", "and", "heritage", "medical", "and", "life", "sciences", "engineering", "healthcare", "and", "social", "science", "marine", "agriculture", "and", "environmental", "business", "financial", "and", "legal", "access", "uea", "talent", "mycareercentral", "raise", "your", "prile", "promote", "your", "opportunities", "share", "your", "knowledge", "cpd", "training", "pressional", "development", "language", "development", "mba", "programmes", "business", "partnerships", "uea", "companies", "norwich", "research", "park", "norfolk", "network", "associated", "partners", "alumni", "and", "supporters", "go", "to", "alumni", "and", "supporters", "home", "your", "uea", "update", "your", "details", "latest", "news", "where", "are", "they", "now", "benefits", "and", "services", "keep", "learning", "bookshelf", "newsletters", "annual", "magazine", "mailing", "preferences", "archive", "ziggurat", "website", "stay", "involved", "host", "an", "event", "alumni", "groups", "worldwide", "submit", "career", "case", "study", "the", "difference", "campaign", "campaign", "news", "impact", "stories", "make", "a", "gift", "donor", "lists", "alumni", "call", "campaign", "leaving", "a", "legacy", "events", "careers", "contact", "us", "donate", "current", "students", "and", "staff", "about", "us", "go", "to", "about", "us", "home", "visiting", "and", "staying", "getting", "to", "uea", "tourist", "information", "visitor", "accommodation", "campus", "map", "campus", "facilities", "our", "university", "chancellor", "vice", "chancellor", "executive", "team", "university", "structure", "student", "charter", "history", "the", "university", "annual", "reports", "and", "publications", "corporate", "social", "responsibility", "charities", "information", "equality", "and", "diversity", "sustainability", "widening", "participation", "community", "engagement", "freedom", "information", "creating", "headroom", "media", "room", "latest", "news", "media", "experts", "meet", "the", "communications", "team", "information", "for", "student", "journalists", "interview", "guidance", "press", "release", "archive", "fast", "facts", "internal", "communications", "key", "dates", "and", "events", "semester", "dates", "events", "music", "centre", "contact", "us", "vacancies", "contact", "us", "computing", "school", "computing", "sciences", "school", "computing", "sciences", "liferay", "on", "function", "event", "var", "strbannercontent", "decodeuricomponent", "event", "bannercontent", "var", "strbannercontent", "event", "bannercontent", "var", "strpagetitle", "event", "pagetitle", "ipc", "banner", "html", "strbannercontent", "if", "event", "pagetitle", "html", "strpagetitle", "for", "ipc", "content", "add", "customheight", "class", "to", "heroimage", "div", "addclass", "customheight", "document", "getelementbyid", "ipcbannercontent", "innerhtml", "strbannercontent", "school", "computing", "sciences", "faculties", "and", "schoolsscienceschool", "computing", "sciences", "undergraduate", "degrees", "postgraduate", "taught", "degrees", "research", "degrees", "people", "research", "careers", "and", "employability", "engagement", "and", "outreach", "equality", "and", "athena", "swan", "new", "student", "information", "working", "with", "business", "continuing", "pressional", "development", "news", "and", "events", "contact", "us", "current", "students", "alumniabout", "the", "facultyactuarial", "sciencesbiological", "sciencesbiochemistrychemistryengineeringenvironmental", "sciencesgeographymathematicsnatural", "sciencespharmacyresearchphysicsfellowshipsgraduate", "school", "span", "class", "onmouseover", "liferay", "portal", "tooltip", "show", "this", "x", "xthe", "xmost", "xexperienced", "xschools", "x", "xcomputing", "xsciences", "xin", "xthe", "one", "the", "most", "experienced", "schools", "computing", "sciences", "in", "the", "uk", "one", "the", "most", "experienced", "schools", "computing", "sciences", "in", "the", "uk", "latest", "news", "cmp", "and", "earlham", "researchers", "develop", "new", "phylogenetics", "stware", "package", "latest", "events", "computer", "graphics", "vr", "and", "ar", "in", "medical", "applications", "publications", "published", "publications", "welcome", "to", "the", "school", "computing", "sciences", "were", "founded", "over", "years", "ago", "and", "we", "pride", "ourselves", "on", "teaching", "and", "research", "that", "is", "relevant", "to", "the", "needs", "now", "and", "the", "future", "believe", "that", "we", "learn", "by", "doing", "so", "we", "teach", "using", "a", "practical", "hands", "on", "approach", "in", "combination", "with", "the", "latest", "theories", "our", "graduates", "are", "highly", "employable", "once", "they", "finish", "their", "degrees", "the", "latest", "employment", "figures", "show", "that", "our", "undergraduates", "found", "work", "or", "study", "within", "six", "months", "leaving", "and", "those", "were", "in", "graduate", "level", "jobs", "our", "research", "has", "won", "awards", "and", "prizes", "and", "is", "dominated", "by", "what", "the", "research", "excellence", "framework", "ref", "called", "world", "leading", "internationally", "excellent", "our", "laboratory", "facilities", "are", "outstanding", "fering", "general", "computing", "labs", "a", "specialised", "computer", "graphics", "lab", "an", "electronics", "hardware", "lab", "we", "are", "committed", "to", "the", "principles", "the", "athena", "swan", "charter", "recognises", "and", "celebrates", "good", "practice", "in", "recruiting", "retaining", "and", "promoting", "women", "in", "science", "technology", "engineering", "mathematics", "and", "medicine", "stemm", "in", "higher", "education", "we", "have", "already", "been", "awarded", "a", "bronze", "award", "and", "are", "in", "the", "process", "applying", "for", "a", "silver", "award", "also", "on", "imagelink", "font", "size", "px", "important", "imagelink", "div", "background", "color", "fac", "imagelink", "div", "p", "first", "child", "padding", "px", "px", "line", "height", "px", "font", "size", "px", "important", "imagelink", "div", "p", "first", "child", "p", "div", "border", "top", "px", "solid", "fac", "undergraduate", "degrees", "function", "getstyleprop", "elem", "prop", "return", "window", "getcomputedstyle", "elem", "null", "getpropertyvalue", "prop", "document", "ready", "function", "var", "imagelinktext", "imagelink", "resizefont", "imagelinktext", "function", "resizefont", "ptagcontent", "var", "imagelink", "document", "getelementbyid", "imagelink", "var", "linklengthmax", "if", "window", "width", "if", "ptagcontent", "text", "length", "linklengthmax", "imagelink", "style", "fontsize", "px", "var", "imagelink", "document", "getelementbyid", "imagelink", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "overwrite__", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "mainimagelinks", "imagelink", "parentnode", "style", "padding", "imagelink", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "borderless", "overwrite", "imagelink", "font", "size", "px", "important", "imagelink", "div", "background", "color", "fac", "imagelink", "div", "p", "first", "child", "padding", "px", "px", "line", "height", "px", "font", "size", "px", "important", "imagelink", "div", "p", "first", "child", "p", "div", "border", "top", "px", "solid", "fac", "working", "with", "business", "function", "getstyleprop", "elem", "prop", "return", "window", "getcomputedstyle", "elem", "null", "getpropertyvalue", "prop", "document", "ready", "function", "var", "imagelinktext", "imagelink", "resizefont", "imagelinktext", "function", "resizefont", "ptagcontent", "var", "imagelink", "document", "getelementbyid", "imagelink", "var", "linklengthmax", "if", "window", "width", "if", "ptagcontent", "text", "length", "linklengthmax", "imagelink", "style", "fontsize", "px", "var", "imagelink", "document", "getelementbyid", "imagelink", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "overwrite__", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "mainimagelinks", "imagelink", "parentnode", "style", "padding", "imagelink", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "borderless", "overwrite", "imagelink", "font", "size", "px", "important", "imagelink", "div", "background", "color", "fac", "imagelink", "div", "p", "first", "child", "padding", "px", "px", "line", "height", "px", "font", "size", "px", "important", "imagelink", "div", "p", "first", "child", "p", "div", "border", "top", "px", "solid", "fac", "postgraduate", "degrees", "function", "getstyleprop", "elem", "prop", "return", "window", "getcomputedstyle", "elem", "null", "getpropertyvalue", "prop", "document", "ready", "function", "var", "imagelinktext", "imagelink", "resizefont", "imagelinktext", "function", "resizefont", "ptagcontent", "var", "imagelink", "document", "getelementbyid", "imagelink", "var", "linklengthmax", "if", "window", "width", "if", "ptagcontent", "text", "length", "linklengthmax", "imagelink", "style", "fontsize", "px", "var", "imagelink", "document", "getelementbyid", "imagelink", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "overwrite__", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "mainimagelinks", "imagelink", "parentnode", "style", "padding", "imagelink", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "borderless", "overwrite", "imagelink", "font", "size", "px", "important", "imagelink", "div", "background", "color", "fac", "imagelink", "div", "p", "first", "child", "padding", "px", "px", "line", "height", "px", "font", "size", "px", "important", "imagelink", "div", "p", "first", "child", "p", "div", "border", "top", "px", "solid", "fac", "research", "function", "getstyleprop", "elem", "prop", "return", "window", "getcomputedstyle", "elem", "null", "getpropertyvalue", "prop", "document", "ready", "function", "var", "imagelinktext", "imagelink", "resizefont", "imagelinktext", "function", "resizefont", "ptagcontent", "var", "imagelink", "document", "getelementbyid", "imagelink", "var", "linklengthmax", "if", "window", "width", "if", "ptagcontent", "text", "length", "linklengthmax", "imagelink", "style", "fontsize", "px", "var", "imagelink", "document", "getelementbyid", "imagelink", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "overwrite__", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "mainimagelinks", "imagelink", "parentnode", "style", "padding", "imagelink", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "borderless", "overwrite", "imagelink", "font", "size", "px", "important", "imagelink", "div", "background", "color", "fac", "imagelink", "div", "p", "first", "child", "padding", "px", "px", "line", "height", "px", "font", "size", "px", "important", "imagelink", "div", "p", "first", "child", "p", "div", "border", "top", "px", "solid", "fac", "news", "and", "events", "function", "getstyleprop", "elem", "prop", "return", "window", "getcomputedstyle", "elem", "null", "getpropertyvalue", "prop", "document", "ready", "function", "var", "imagelinktext", "imagelink", "resizefont", "imagelinktext", "function", "resizefont", "ptagcontent", "var", "imagelink", "document", "getelementbyid", "imagelink", "var", "linklengthmax", "if", "window", "width", "if", "ptagcontent", "text", "length", "linklengthmax", "imagelink", "style", "fontsize", "px", "var", "imagelink", "document", "getelementbyid", "imagelink", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "overwrite__", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "mainimagelinks", "imagelink", "parentnode", "style", "padding", "imagelink", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "borderless", "overwrite", "imagelink", "font", "size", "px", "important", "imagelink", "div", "background", "color", "fac", "imagelink", "div", "p", "first", "child", "padding", "px", "px", "line", "height", "px", "font", "size", "px", "important", "imagelink", "div", "p", "first", "child", "p", "div", "border", "top", "px", "solid", "fac", "research", "degrees", "function", "getstyleprop", "elem", "prop", "return", "window", "getcomputedstyle", "elem", "null", "getpropertyvalue", "prop", "document", "ready", "function", "var", "imagelinktext", "imagelink", "resizefont", "imagelinktext", "function", "resizefont", "ptagcontent", "var", "imagelink", "document", "getelementbyid", "imagelink", "var", "linklengthmax", "if", "window", "width", "if", "ptagcontent", "text", "length", "linklengthmax", "imagelink", "style", "fontsize", "px", "var", "imagelink", "document", "getelementbyid", "imagelink", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "overwrite__", "imagelink", "parentnode", "parentnode", "parentnode", "parentnode", "parentnode", "classname", "mainimagelinks", "imagelink", "parentnode", "style", "padding", "imagelink", "parentnode", "parentnode", "parentnode", "classname", "specified", "portlet", "borderless", "overwrite", "aui", "blockquote", "p", "font", "size", "px", "aui", "narrow", "list", "ul", "margin", "left", "em", "portlet", "topper", "h", "portlet", "title", "background", "none", "inline", "call", "to", "action", "buttons", "links", "see", "https", "www", "uea", "ac", "uk", "study", "experienceuea", "student", "experience", "for", "an", "example", "journal", "content", "article", "a", "inlinecta", "color", "fff", "important", "display", "inline", "block", "display", "inline", "zoom", "width", "px", "font", "weight", "background", "f", "url", "documents", "chevron", "eee", "ce", "bb", "ad", "cce", "t", "no", "repeat", "center", "padding", "px", "px", "px", "px", "margin", "px", "text", "decoration", "none", "journal", "content", "article", "a", "hover", "inlinecta", "journal", "content", "article", "a", "focus", "inlinecta", "background", "color", "bb", "aui", "footer", "blackbarwrapper", "footerblackbar", "mobilefootersection", "mobilefooterlinks", "a", "width", "display", "inline", "block", "margin", "top", "px", "color", "f", "aui", "footer", "blackbarwrapper", "footerblackbar", "mobilefootersection", "height", "px", "aui", "footer", "goldtef", "margin", "top", "px", "margin", "left", "px", "popular", "with", "other", "visitors", "undergraduate", "study", "postgraduate", "study", "find", "a", "course", "student", "life", "in", "norwich", "uea", "research", "about", "uea", "study", "with", "us", "uea", "faculty", "pages", "arts", "and", "humanities", "medicine", "and", "health", "sciences", "science", "social", "sciences", "undergraduate", "prospectus", "download", "download", "prospectus", "back", "to", "top", "download", "prospectus", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "uea", "all", "rights", "reserved", "university", "east", "anglia", "norwich", "research", "park", "norwich", "norfolk", "nr", "tj", "uk", "switchboard", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "cdata", "liferay", "util", "addinputfocus", "cdata", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xd_instance_jbrgcivtk", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdcolumn", "xp_p_col_pos", "xd", "xp_p_col_count", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xd_instance_cgsugzxzf", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdcolumn", "xp_p_col_pos", "xd", "xp_p_col_count", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xd_instance_yvmlmlqcjyf", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdcolumn", "xp_p_col_pos", "xd", "xp_p_col_count", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xdueabanner_war_ueabannerportlet_instance_theme", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdnull", "xp_p_col_pos", "xdnull", "xp_p_col_count", "xdnull", "xp_p_static", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xd_instance_qrmvokyoqp", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdcolumn", "xp_p_col_pos", "xd", "xp_p_col_count", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xd_instance_zpdywkcugfd", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdcolumn", "xp_p_col_pos", "xd", "xp_p_col_count", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xd_instance_wfevmczj", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdcolumn", "xp_p_col_pos", "xd", "xp_p_col_count", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xd_instance_yconenoqb", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdcolumn", "xp_p_col_pos", "xd", "xp_p_col_count", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "liferay", "portlet", "onload", "canedittitle", "false", "columnpos", "isstatic", "namespacedid", "portletid", "refreshurl", "xfc", "xfportal", "xfrender_portlet", "xfp_l_id", "xd", "xp_p_id", "xdueanavigation_war_ueanavigation", "xp_p_lifecycle", "xd", "xp_t_lifecycle", "xd", "xp_p_state", "xdnormal", "xp_p_mode", "xdview", "xp_p_col_id", "xdcolumn", "xp_p_col_pos", "xd", "xp_p_col_count", "xd", "xp_p_isolated", "xd", "xcurrenturl", "xd", "xfweb", "xfcomputing", "aui", "use", "function", "a", "function", "liferay", "util", "addinputtype", "liferay", "portlet", "ready", "function", "portletid", "node", "liferay", "util", "addinputtype", "node", "if", "a", "ua", "mobile", "liferay", "util", "addinputcancel", "function", "new", "liferay", "menu", "var", "liferaynotices", "liferay", "data", "notices", "for", "var", "i", "i", "liferaynotices", "length", "i", "new", "liferay", "notice", "liferaynotices", "i", "function", "liferay", "session", "new", "liferay", "sessionbase", "autoextend", "true", "sessionlength", "redirectonexpire", "false", "redirecturl", "xa", "xf", "xfwww", "xeuea", "xeac", "xeuk", "xfweb", "warninglength", "cdata", "function", "downloadjsatonload", "var", "element", "document", "createelement", "script", "element", "src", "https", "www", "uea", "ac", "uk", "uea", "theme", "js", "defer", "js", "document", "body", "appendchild", "element", "if", "window", "addeventlistener", "window", "addeventlistener", "load", "downloadjsatonload", "false", "else", "if", "window", "attachevent", "window", "attachevent", "onload", "downloadjsatonload", "else", "window", "onload", "downloadjsatonload", "xfhome", "xfnew", "xfhome", "xfnew", "p_p_id__instance_corgphaxed_", "xto", "xuea", "xschool", "know", "lots", "do", "before", "you", "arrive", "but", "worry", "here", "help", "will", "guide", "you", "through", "necessary", "processes", "administrative", "tasks", "while", "giving", "you", "insight", "into", "like", "at", "page", "will", "give", "you", "more", "alternatively", "you", "can", "section", "directly", "clicking", "below", "you", "any", "questions", "arrival", "at", "please", "email", "admissions", "question", "directly", "related", "please", "email", "cmpmth", "lso", "postgraduates", "xd_instance_corgphaxed", "xfhome", "xfnew", "xfhome", "xfnew", "xd_instance_xhmazxamrxs", "xfhome", "xfnew", "xd_instance_snwurosoptl", "xfhome", "xfnew", "xd_instance_xzkpkwang", "xfhome", "xfnew", "xfhome", "xfnew", "xfresearch", "xfresearch", "p_p_id__instance_duoacipli_", "phd", "phd", "place", "degree", "organised", "three", "computational", "biology", "vision", "speech", "machine", "statistics", "these", "carried", "out", "computational", "biology", "speech", "processing", "vision", "colour", "processing", "mining", "optimisation", "machine", "statistics", "part", "which", "includes", "john", "innes", "sainsbury", "genome", "analysis", "food", "hospital", "trust", "strong", "collaborative", "across", "join", "be", "via", "project", "addition", "performed", "across", "be", "prospective", "supervisors", "whose", "interested", "be", "viewed", "via", "web", "address", "above", "be", "prospective", "pgr", "enquiries", "admiss", "further", "it", "anticipated", "majority", "successful", "applicants", "october", "each", "year", "some", "may", "be", "able", "standard", "entry", "points", "january", "april", "july", "funded", "competitively", "funded", "phd", "projects", "funded", "projects", "choose", "best", "applicant", "project", "competitively", "funded", "projects", "choose", "best", "applicants", "set", "projects", "usually", "only", "available", "applicants", "covers", "provides", "tax", "stipend", "approximately", "year", "phd", "view", "projects", "xd_instance_duoacipli", "xfresearch", "xfresearch", "xfresearch", "xfcontact", "xfcontact", "p_p_id__instance_etc_", "touch", "touch", "tel", "fax", "xfcontact", "xd_instance_etc", "xfcontact", "xfcontact", "xfworking", "xfworking", "p_p_id__instance_cbyaabopmm_", "xand", "xenterprise", "enterprise", "enterprise", "sustainable", "relationships", "local", "national", "businesses", "commitment", "close", "industry", "commercial", "activities", "including", "own", "company", "sysco", "ten", "run", "collaboration", "commercial", "mean", "step", "changing", "recent", "examples", "enterprise", "activities", "runs", "programme", "businesses", "bespoke", "individual", "syrinix", "haptimol", "urban", "modelling", "lingua", "virtual", "past", "printing", "animgen", "monitoring", "xd_instance_cbyaabopmm", "xfworking", "xfworking", "xd_instance_rlflf", "xfworking", "xd_instance_fcskluzyqpe", "xfworking", "xd_instance_zmxejuoudzg", "xfworking", "xd_instance_fytbbsrtci", "xfworking", "xfworking", "xd_instance_abmmsxmah", "xfworking", "xd_instance_rczkjxjxxcr", "xfworking", "xd_instance_qtxnlhyqf", "xfworking", "xd_instance_bwyterhbgbg", "xfworking", "xd_instance_hululwzqaeh", "xfworking", "xfundergraduate", "xfundergraduate", "p_p_id__instance_uahshfkrjik_", "p_p_id_coursecataloguedisplay__war_course_portlet_instance_zpxipefi_", "xchoose", "xscience", "xat", "why", "why", "fer", "ranked", "nd", "satisfaction", "nss", "fer", "aligned", "aspirations", "inter", "disciplinary", "enable", "understand", "contemporary", "track", "onto", "topics", "comprises", "expert", "academic", "scientists", "plus", "guaranteed", "cutting", "edge", "full", "full", "lfr", "pagination", "delta", "selector", "items", "per", "showing", "results", "previous", "next", "last", "th", "_coursecataloguedisplay__war_course_portlet_instance_zpxipefi_searchcontainer_col", "bsc", "bsc", "bsc", "applied", "bsc", "systems", "bsc", "systems", "bsc", "imaging", "multimedia", "bsc", "imaging", "multimedia", "beng", "systems", "beng", "systems", "bsc", "mcomp", "bsc", "mcomp", "bsc", "items", "per", "showing", "results", "previous", "next", "last", "taglib", "iterator", "taglib", "iterator", "iterator", "taglib", "iterator", "iterator", "bottom", "book", "_coursecataloguedisplay__war_course_portlet_instance_zpxipefi_submitform", "curparam", "cur", "curparam", "cur", "bcpr__coursecataloguedisplay__war_course_portlet_instance_zpxipefi_pageiteratorfm", "submitform", "_coursecataloguedisplay__war_course_portlet_instance_zpxipefi_submitform", "curparam", "cur", "curparam", "cur", "tjjw__coursecataloguedisplay__war_course_portlet_instance_zpxipefi_pageiteratorfm", "submitform", "xdcoursecataloguedisplay__war_course_portlet_instance_zpxipefi", "xfundergraduate", "xd_instance_lpthbdehmel", "xfundergraduate", "xfundergraduate", "xd_instance_uahshfkrjik", "xfundergraduate", "xfundergraduate", "icon", "register", "forcepost", "usedialog", "icon", "register", "forcepost", "usedialog", "register", "icon", "register", "forcepost", "usedialog", "register", "searchcontainer", "classnamehover", "rowclassnamealternate", "rowclassnamealternatehover", "rowclassnamebody", "rowclassnamebodyhover", "render", "sciencespeople", "role", "head", "pressor", "gerard", "parr", "pressor", "gerard", "parr", "deputy", "head", "pressor", "andy", "pressor", "andy", "director", "dr", "rudy", "lapeer", "dr", "rudy", "lapeer", "director", "gerard", "parr", "gerard", "parr", "director", "innovation", "dr", "steven", "hayward", "dr", "steven", "hayward", "director", "dr", "dan", "smith", "dr", "dan", "smith", "director", "dr", "katharina", "huber", "dr", "katharina", "huber", "director", "richard", "harvey", "richard", "harvey", "manager", "nadia", "mobbs", "nadia", "mobbs", "head", "pa", "sue", "spurgeon", "sue", "spurgeon", "responsibilities", "support", "associate", "tutors", "honorary", "support", "xd_instance_serxxilft", "xd_instance_qlyeilfzz", "xd_instance_lhtinscmujt", "xd_instance_fshublwwjrx", "xd_instance_mvllzbmsenvl", "xd_instance_bhnpdtlnzbs", "xd_instance_czveewwmrzf", "xd_instance_uvvglmolubv", "xd_instance_udrqvpr", "xd_instance_uypceawnzzs", "p_p_id__instance_eucbvxgbs_", "sciencesworking", "xtechnology", "xdeveloped", "xby", "innovative", "developed", "innovative", "developed", "spinout", "innovative", "developed", "from", "was", "named", "initiative", "times", "supplement", "recently", "prestigious", "clean", "tech", "investment", "bbaa", "british", "angels", "association", "leads", "way", "trunk", "water", "leak", "defection", "helping", "major", "water", "intervene", "successfully", "prevent", "failure", "pipes", "subsequent", "loss", "water", "xd_instance_eucbvxgbs", "xfpeople", "xfprile", "xflist", "xfpeople", "xfprile", "xflist", "sciencespeopleall", "holders", "xfpeople", "xfprile", "xflist", "xfhonorary", "x_people_war_peopleportlet_mode", "x_people_war_peopleportlet_listtype", "xdhonorary", "x_people_war_peopleportlet_portletmode", "xfpeople", "xfprile", "xflist", "addhtml", "parse", "xb", "oncomplete", "xdpeople_war_peopleportlet", "xfpeople", "xfprile", "xflist", "xdpeople_war_peopleportlet", "xfpeople", "xfprile", "xflist", "xfpostgraduate", "xfpostgraduate", "p_p_id__instance_kqowihrrq_", "p_p_id_coursecataloguedisplay__war_course_portlet_instance_dckkizfpwi_", "p_p_id_coursecataloguedisplay__war_course_portlet_instance_nblprtfcxn_", "p_p_id__instance_tbmkbdibvpck_", "p_p_id__instance_qqkvkjpx_", "p_p_id__instance_qqkvkjpx_", "ffffff", "radius", "ffffff", "ffffff", "xon", "xyour", "build", "build", "wide", "range", "exciting", "msc", "enabling", "specialise", "subjects", "allied", "build", "different", "disciplines", "encourage", "refer", "choosing", "my", "msc", "mscs", "up", "paths", "improve", "prospects", "taken", "job", "_coursecataloguedisplay__war_course_portlet_instance_dckkizfpwi_searchcontainer_col", "msc", "advanced", "msc", "msc", "msc", "discovery", "datamining", 