["school", "computing", "sciences", "uea", "iframe", "src", "www", "googletagmanager", "com", "ns", "html", "id", "gtm", "tnfp", "height", "width", "style", "display", "none", "visibility", "hidden", "input", "name", "term", "type", "text", "class", "search", "query", "search", "text", "placeholder", "site", "search", "id", "header", "search", "text", "accesskey", "title", "access", "key", "onfocus", "if", "this", "value", "this", "value", "onblur", "if", "this", "value", "this", "value", "value", "site", "search", "vacancies", "contact", "us", "sign", "in", "uea", "students", "and", "staff", "everyone", "else", "main", "menu", "home", "study", "with", "us", "go", "to", "study", "with", "us", "home", "undergraduate", "course", "finder", "clearing", "and", "adjustment", "request", "a", "prospectus", "mini", "open", "day", "applying", "accommodation", "scholarships", "fees", "and", "funding", "visit", "us", "student", "life", "advice", "for", "future", "students", "mature", "students", "your", "future", "career", "ask", "uea", "new", "students", "postgraduate", "course", "finder", "accommodation", "applying", "request", "a", "prospectus", "postgraduate", "taught", "degrees", "fees", "scholarships", "and", "loans", "visit", "us", "postgraduate", "research", "degrees", "phds", "studentships", "research", "themes", "fees", "and", "funding", "how", "to", "apply", "international", "your", "country", "eu", "students", "studying", "in", "the", "uk", "applying", "as", "an", "international", "student", "fees", "and", "funding", "visit", "us", "accommodation", "international", "families", "international", "summer", "school", "a", "href", "study", "international", "malaysia", "international", "fice", "malaysia", "international", "office", "a", "href", "study", "international", "foundation", "and", "diploma", "programmes", "foundation", "and", "diploma", "programmes", "international", "programmes", "contact", "us", "short", "courses", "and", "pressional", "development", "foundation", "courses", "cpd", "summer", "schools", "free", "online", "learning", "information", "for", "parents", "teachers", "young", "people", "parents", "teachers", "young", "people", "study", "abroad", "and", "exchange", "incoming", "outgoing", "contact", "us", "research", "research", "research", "themes", "explore", "uea", "research", "postgraduate", "research", "about", "uea", "research", "research", "performance", "fellowships", "faculties", "and", "schools", "go", "to", "faculties", "and", "schools", "home", "arts", "and", "humanities", "art", "media", "and", "american", "studies", "history", "interdisciplinary", "institute", "for", "the", "humanities", "literature", "drama", "and", "creative", "writing", "politics", "philosophy", "language", "and", "communication", "studies", "graduate", "school", "medicine", "and", "health", "sciences", "health", "sciences", "norwich", "medical", "school", "centre", "for", "interpressional", "practice", "continuing", "pressional", "development", "graduate", "school", "science", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "computing", "sciences", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "physics", "graduate", "school", "social", "sciences", "economics", "education", "and", "lifelong", "learning", "geography", "international", "development", "law", "norwich", "business", "school", "psychology", "social", "work", "graduate", "school", "business", "go", "to", "business", "home", "contact", "us", "funding", "opportunities", "sponsored", "research", "knowledge", "transfer", "partnerships", "consultancy", "gis", "consulting", "consultancy", "case", "studies", "facilities", "testing", "conference", "space", "our", "laboratories", "testing", "our", "specialist", "facilities", "licensing", "opportunities", "digital", "creative", "and", "heritage", "medical", "and", "life", "sciences", "engineering", "healthcare", "and", "social", "science", "marine", "agriculture", "and", "environmental", "business", "financial", "and", "legal", "access", "uea", "talent", "mycareercentral", "raise", "your", "prile", "promote", "your", "opportunities", "share", "your", "knowledge", "cpd", "training", "pressional", "development", "language", "development", "mba", "programmes", "business", "partnerships", "uea", "companies", "norwich", "research", "park", "norfolk", "network", "associated", "partners", "alumni", "and", "supporters", "go", "to", "alumni", "and", "supporters", "home", "your", "uea", "update", "your", "details", "latest", "news", "where", "are", "they", "now", "benefits", "and", "services", "keep", "learning", "bookshelf", "newsletters", "annual", "magazine", "mailing", "preferences", "archive", "ziggurat", "website", "stay", "involved", "host", "an", "event", "alumni", "groups", "worldwide", "submit", "career", "case", "study", "the", "difference", "campaign", "campaign", "news", "impact", "stories", "make", "a", "gift", "donor", "lists", "alumni", "call", "campaign", "leaving", "a", "legacy", "events", "careers", "contact", "us", "donate", "current", "students", "and", "staff", "about", "us", "go", "to", "about", "us", "home", "visiting", "and", "staying", "getting", "to", "uea", "tourist", "information", "visitor", "accommodation", "campus", "map", "campus", "facilities", "our", "university", "chancellor", "vice", "chancellor", "executive", "team", "university", "structure", "student", "charter", "history", "the", "university", "annual", "reports", "and", "publications", "corporate", "social", "responsibility", "charities", "information", "equality", "and", "diversity", "sustainability", "widening", "participation", "community", "engagement", "freedom", "information", "creating", "headroom", "media", "room", "latest", "news", "media", "experts", "meet", "the", "communications", "team", "information", "for", "student", "journalists", "interview", "guidance", "press", "release", "archive", "fast", "facts", "internal", "communications", "key", "dates", "and", "events", "semester", "dates", "events", "music", "centre", "contact", "us", "vacancies", "contact", "us", "computing", "school", "computing", "sciences", "school", "computing", "sciences", "school", "computing", "sciences", "faculties", "and", "schoolsscienceschool", "computing", "sciences", "undergraduate", "degrees", "postgraduate", "taught", "degrees", "research", "degrees", "people", "research", "careers", "and", "employability", "engagement", "and", "outreach", "equality", "and", "athena", "swan", "new", "student", "information", "working", "with", "business", "continuing", "pressional", "development", "news", "and", "events", "contact", "us", "current", "students", "alumniabout", "the", "facultyactuarial", "sciencesbiological", "sciencesbiochemistrychemistryengineeringenvironmental", "sciencesgeographymathematicsnatural", "sciencespharmacyresearchphysicsfellowshipsgraduate", "school", "span", "class", "onmouseover", "liferay", "portal", "tooltip", "show", "this", "x", "xthe", "xmost", "xexperienced", "xschools", "x", "xcomputing", "xsciences", "xin", "xthe", "one", "the", "most", "experienced", "schools", "computing", "sciences", "in", "the", "uk", "one", "the", "most", "experienced", "schools", "computing", "sciences", "in", "the", "uk", "latest", "news", "cmp", "and", "earlham", "researchers", "develop", "new", "phylogenetics", "stware", "package", "latest", "events", "computer", "graphics", "vr", "and", "ar", "in", "medical", "applications", "publications", "published", "publications", "welcome", "to", "the", "school", "computing", "sciences", "were", "founded", "over", "years", "ago", "and", "we", "pride", "ourselves", "on", "teaching", "and", "research", "that", "is", "relevant", "to", "the", "needs", "now", "and", "the", "future", "believe", "that", "we", "learn", "by", "doing", "so", "we", "teach", "using", "a", "practical", "hands", "on", "approach", "in", "combination", "with", "the", "latest", "theories", "our", "graduates", "are", "highly", "employable", "once", "they", "finish", "their", "degrees", "the", "latest", "employment", "figures", "show", "that", "our", "undergraduates", "found", "work", "or", "study", "within", "six", "months", "leaving", "and", "those", "were", "in", "graduate", "level", "jobs", "our", "research", "has", "won", "awards", "and", "prizes", "and", "is", "dominated", "by", "what", "the", "research", "excellence", "framework", "ref", "called", "world", "leading", "internationally", "excellent", "our", "laboratory", "facilities", "are", "outstanding", "fering", "general", "computing", "labs", "a", "specialised", "computer", "graphics", "lab", "an", "electronics", "hardware", "lab", "we", "are", "committed", "to", "the", "principles", "the", "athena", "swan", "charter", "recognises", "and", "celebrates", "good", "practice", "in", "recruiting", "retaining", "and", "promoting", "women", "in", "science", "technology", "engineering", "mathematics", "and", "medicine", "stemm", "in", "higher", "education", "we", "have", "already", "been", "awarded", "a", "bronze", "award", "and", "are", "in", "the", "process", "applying", "for", "a", "silver", "award", "also", "on", "undergraduate", "degrees", "working", "with", "business", "postgraduate", "degrees", "research", "news", "and", "events", "research", "degrees", "popular", "with", "other", "visitors", "undergraduate", "study", "postgraduate", "study", "find", "a", "course", "student", "life", "in", "norwich", "uea", "research", "about", "uea", "study", "with", "us", "uea", "faculty", "pages", "arts", "and", "humanities", "medicine", "and", "health", "sciences", "science", "social", "sciences", "undergraduate", "prospectus", "download", "download", "prospectus", "back", "to", "top", "download", "prospectus", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "uea", "all", "rights", "reserved", "university", "east", "anglia", "norwich", "research", "park", "norwich", "norfolk", "nr", "tj", "uk", "switchboard", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "phd", "phd", "place", "degree", "organised", "into", "three", "computational", "biology", "vision", "speech", "machine", "statistics", "these", "carried", "out", "computational", "biology", "speech", "processing", "vision", "colour", "processing", "mining", "optimisation", "machine", "statistics", "part", "which", "includes", "at", "john", "innes", "sainsbury", "genome", "analysis", "food", "hospital", "trust", "strong", "collaborative", "links", "across", "join", "can", "be", "via", "project", "links", "below", "addition", "performed", "across", "can", "be", "prospective", "supervisors", "whose", "interested", "can", "be", "viewed", "via", "web", "at", "address", "above", "can", "be", "prospective", "pgr", "enquiries", "admiss", "ac", "further", "at", "it", "anticipated", "majority", "successful", "applicants", "will", "start", "october", "each", "year", "but", "some", "may", "be", "able", "start", "at", "standard", "entry", "points", "january", "april", "july", "directly", "funded", "competitively", "funded", "phd", "projects", "directly", "funded", "projects", "choose", "best", "applicant", "project", "competitively", "funded", "projects", "choose", "best", "applicants", "set", "projects", "usually", "only", "available", "applicants", "covers", "provides", "tax", "stipend", "approximately", "year", "phd", "view", "projects", "sciencesresearch", "seminars", "conferences", "recently", "xresearch", "xlabs", "xcontributing", "xto", "xexcellent", "xresearch", "dedicated", "contributing", "activity", "dedicated", "contributing", "activity", "computers", "almost", "every", "facet", "lives", "application", "techniques", "areas", "diverse", "insurance", "images", "collaborate", "multi", "national", "such", "apple", "disney", "aviva", "well", "institutes", "universities", "acclaimed", "rated", "recent", "assessment", "exercise", "environment", "judged", "mostly", "computers", "built", "solid", "theoretical", "do", "please", "see", "from", "several", "sources", "including", "councils", "nhs", "government", "sources", "industry", "own", "company", "ltd", "enables", "expertise", "problems", "presented", "clients", "who", "range", "from", "local", "authorities", "smes", "national", "spun", "number", "itself", "currently", "around", "active", "members", "informs", "influences", "vital", "moving", "field", "such", "you", "more", "repository", "seminars", "xon", "xyour", "build", "build", "fer", "wide", "exciting", "msc", "enabling", "specialise", "subjects", "allied", "build", "different", "disciplines", "encourage", "refer", "page", "choosing", "my", "msc", "mscs", "up", "paths", "improve", "prospects", "time", "taken", "full", "time", "job", "full", "time", "full", "time", "th", "_coursecataloguedisplay__war_course_portlet_instance_dckkizfpwi_searchcontainer_col", "msc", "advanced", "msc", "msc", "systems", "msc", "discovery", "datamining", "time", "time", "th", "_coursecataloguedisplay__war_course_portlet_instance_nblprtfcxn_searchcontainer_col", "msc", "advanced", "time", "time", "msc", "time", "time", "msc", "systems", "time", "time", "msc", "discovery", "datamining", "time", "time", "msc", "discovery", "datamining", "time", "time", "xscholarships", "xand", "p", "margin", "cm", "margin", "right", "cm", "margin", "bottom", "pt", "margin", "left", "cm", "line", "pt", "re", "wants", "pursue", "fer", "discover", "why", "pays", "get", "first", "p", "margin", "cm", "margin", "right", "cm", "margin", "bottom", "pt", "margin", "left", "cm", "line", "pt", "re", "generally", "pioneering", "british", "there", "s", "scholarship", "options", "specific", "options", "p", "margin", "cm", "margin", "right", "cm", "margin", "bottom", "pt", "margin", "left", "cm", "line", "pt", "up", "lunchtime", "sessions", "simply", "tour", "looking", "not", "listed", "admissions", "alternatively", "try", "touch", "touch", "tel", "fax", "email", "cmpmth", "lso", "email", "sciencesengagement", "interactive", "programming", "xbox", "robotics", "control", "automated", "robots", "lego", "mindstorms", "system", "xaspirations", "xfor", "xpre", "raising", "aspirations", "pre", "raising", "aspirations", "pre", "runs", "aspirations", "progression", "runs", "workshops", "days", "variety", "related", "aims", "expand", "existing", "skills", "provide", "insight", "examples", "activities", "fers", "variety", "fered", "robotics", "d", "animation", "programming", "skills", "workshops", "either", "f", "visits", "programming", "workshop", "newspaper", "report", "example", "typical", "days", "schedule", "schedules", "flexible", "made", "accommodate", "days", "required", "informal", "introduction", "department", "session", "any", "morning", "session", "could", "include", "robot", "programming", "lunch", "session", "e", "g", "game", "conclusion", "timetable", "approximate", "guide", "structured", "follow", "building", "upon", "previous", "session", "subject", "area", "instance", "could", "two", "same", "robotics", "robotics", "robotics", "session", "followed", "schedule", "fered", "throughout", "aim", "supplement", "without", "interrupting", "restrictions", "during", "must", "contacting", "something", "arranged", "date", "suits", "concerned", "any", "dr", "pam", "mayhew", "attending", "clear", "experience", "ideas", "outside", "established", "educational", "institution", "experiences", "spark", "imagination", "give", "clearer", "idea", "wish", "valuable", "introduction", "content", "small", "hand", "advise", "aspects", "ideas", "planning", "evaluation", "assistance", "small", "expenses", "fund", "loan", "equipment", "audio", "recorders", "cas", "cas", "hub", "meets", "twice", "per", "pulls", "together", "representatives", "merrier", "would", "like", "come", "along", "groupspaces", "ncas", "next", "meeting", "xpublished", "xcmp", "discriminative", "block", "diagonal", "representation", "image", "recognition", "final", "version", "zhang", "z", "xu", "y", "shao", "l", "yang", "j", "ieee", "transactions", "neural", "networks", "read", "discriminative", "block", "diagonal", "representation", "image", "recognition", "action", "recognition", "histograms", "texture", "boosting", "classifier", "final", "version", "zhang", "b", "yang", "y", "chen", "c", "yang", "l", "han", "j", "shaor", "l", "oct", "ieeee", "transactions", "image", "read", "action", "recognition", "histograms", "texture", "boosting", "classifier", "robust", "face", "recognition", "kernelized", "locally", "sensitive", "group", "sparsity", "representation", "final", "version", "tan", "sun", "chan", "w", "qu", "l", "shao", "l", "oct", "ieeee", "transactions", "image", "read", "robust", "face", "recognition", "kernelized", "locally", "sensitive", "group", "sparsity", "representation", "order", "energies", "image", "segmentation", "final", "version", "shen", "j", "peng", "j", "dong", "shao", "l", "porikli", "ieee", "transactions", "image", "read", "order", "energies", "image", "segmentation", "generating", "intelligible", "visual", "final", "version", "le", "cornu", "t", "milner", "b", "sept", "ieee", "transactions", "read", "generating", "intelligible", "visual", "region", "based", "image", "caption", "generator", "refined", "descriptions", "final", "version", "kinghorn", "zhang", "l", "shao", "l", "neurocomputing", "read", "region", "based", "image", "caption", "generator", "refined", "descriptions", "recoding", "color", "color", "homography", "final", "version", "gong", "h", "finlayson", "fisher", "r", "proceedings", "bmvc", "bmva", "read", "recoding", "color", "color", "homography", "shadow", "removal", "ground", "truth", "vriable", "scene", "categories", "final", "version", "gong", "h", "cosker", "bmvc", "bmva", "read", "shadow", "removal", "ground", "truth", "vriable", "scene", "categories", "concise", "radiometric", "calibration", "power", "ranking", "final", "version", "gong", "h", "finlayson", "mohammadzadeh", "darrodi", "m", "sept", "bmvc", "bmva", "read", "concise", "radiometric", "calibration", "power", "ranking", "nikoloulopoulos", "composite", "likelihood", "bivariate", "meta", "appeared", "asta", "aristidis", "k", "nikoloulopoulos", "composite", "likelihood", "bivariate", "meta", "diagnostic", "test", "accuracy", "appeared", "asta", "advances", "statistical", "read", "nikoloulopoulos", "composite", "likelihood", "bivariate", "meta", "appeared", "asta", "sciencescareers", "post", "docs", "xright", "xsupport", "xprepare", "xyou", "xfuture", "support", "prepare", "support", "prepare", "cent", "secure", "positions", "continue", "academia", "gone", "become", "sales", "executives", "earning", "competitive", "salaries", "whilst", "others", "secured", "positions", "ibm", "logica", "program", "analysts", "designers", "managers", "others", "entrepreneurial", "path", "while", "chose", "continue", "enter", "academia", "pressionally", "support", "of", "market", "very", "competitive", "endeavour", "ensure", "receive", "prepare", "them", "transition", "service", "reflect", "relate", "potential", "run", "invaluable", "finding", "write", "cv", "effectively", "according", "interest", "internships", "enter", "login", "external", "postdoc", "positions", "others", "queries", "director", "pr", "gerard", "parr", "lang", "en", "gb", "description", "tweet", "div", "fb", "font", "https", "asset_publisher", "kkhvexwxzv", "blog", "__instance_kkhvexwxzv_viewmode", "layout", "button_count", "send", "false", "show_faces", "true", "plusone", "count", "true", "https", "asset_publisher", "kkhvexwxzv", "blog", "__instance_kkhvexwxzv_viewmode", "size", "medium", "fdm", "evenings", "fdm", "production", "june", "holding", "evening", "june", "london", "opportunity", "production", "invite", "pdf", "kb", "ukoug", "never", "better", "sector", "ukoug", "holding", "nextgen", "attendance", "designed", "opportunity", "focus", "oracle", "cvs", "consideration", "employers", "prospect", "employers", "opportunity", "thinking", "after", "nearest", "cambridge", "rd", "friends", "midlands", "might", "willing", "travel", "birmingham", "city", "unable", "still", "consideration", "paid", "internship", "permanent", "role", "partnership", "epos", "master", "friday", "involve", "epos", "technologies", "practices", "client", "base", "then", "opportunity", "take", "replicate", "practices", "design", "implementation", "designed", "fun", "relaxed", "atmosphere", "end", "mornings", "provided", "delighted", "announce", "additional", "dimension", "epos", "confirmed", "keen", "recruit", "mornings", "therefore", "unique", "opportunity", "internship", "permanent", "position", "doorstep", "hoping", "fill", "multiple", "tester", "developer", "designer", "developer", "database", "developer", "ms", "sql", "epos", "vibrant", "ambitious", "electronic", "point", "sale", "branded", "innovative", "designed", "house", "expanding", "rapidly", "turnover", "increasing", "last", "invited", "archant", "growth", "timing", "confirmed", "shortly", "avoid", "disappointment", "book", "through", "following", "link", "epos", "eposnow", "questions", "karl", "anton", "adviser", "sci", "anton", "eposnow", "flyer", "pdf", "kb", "drop", "adviser", "karl", "anton"]